[
  {
    "id": "dec031adef3dbde7f1f7ae2bf089a198",
    "title": "Ethereum: a cuánto cotiza este domingo 31 de agosto",
    "description": "Criptomonedas",
    "content": "Este domingo, 31 de agosto de 2025 en España, la cotización delEthereumy eleuroes de5.223,12 euros, cifra que refleja una variación del 2,55% en comparación con el día de ayer.\nEl precio del Ethereum y el euro ha mostrado una tendencia positiva en los últimos días. Esto indica que ambos activos están en un proceso de crecimiento sostenido.\nEn la última semana, la cotización de la criptomoneda Ethereum ha experimentado un leve descenso del -2.28%, lo que refleja una ligera corrección en su valor. Sin embargo, al observar su evolución en el último año, se destaca un notable aumento del 45.12%, evidenciando una tendencia positiva a largo plazo que ha atraído el interés de inversores y entusiastas del mercado de criptomonedas.\nEn la última semana, la cotización de la criptomoneda Ethereum ha experimentado un leve descenso del -2.28%, lo que refleja una ligera corrección en su valor. Sin embargo, al observar su evolución en el último año, se destaca un notable aumento del 45.12%, evidenciando una tendencia positiva a largo plazo que ha atraído el interés de inversores y entusiastas del mercado de criptomonedas.\nLa volatilidad económica de la última semana de Ethereum, con un 39.75%, es significativamente menor que su volatilidad anual del 62.70%, lo que indica que su comportamiento es mucho más estable en el último año.\nLa volatilidad económica de la última semana de Ethereum, con un 39.75%, es significativamente menor que su volatilidad anual del 62.70%, lo que indica que su comportamiento es mucho más estable en el último año.\nDurante los últimos 12 meses, elEthereumha llegado a valer en elmercado españolen un máximo de 5.610,7 euros mientras que su nivel más bajo ha sido 1.607,4 euros.",
    "url": "https://www.cronista.com/espana/criptomonedas-es/ethereum-a-cuanto-cotiza-este-domingo-31-de-agosto/",
    "source": "El Cronista",
    "published_at": "Actualizado el   31 de Agosto de 202515:09",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAmkAAAFbAQMAAAC05YuqAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAADFJREFUeJztwTEBAAAAwqD1T20IX6AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAOA0axUAAVNxUlUAAAAASUVORK5CYII="
    }
  },
  {
    "id": "8551f3e0f122a4a4b12ebb45ceb765f0",
    "title": "Bitcoin: a cuánto cotiza este domingo 31 de agosto",
    "description": "Mundo cripto",
    "content": "Este domingo, 31 de agosto de 2025 en España, la cotización delBitcoiny eleuroes de126.976,76 euros, cifra que refleja una variación del 0,27% en comparación con el día de ayer.\nEl precio del Bitcoin ha mostrado una tendencia positiva en los últimos días, mientras que el euro ha mantenido una tendencia estable. Esto sugiere que el interés en Bitcoin está en aumento, mientras que el euro no presenta cambios significativos en su valor.\nEn la última semana, la cotización de la criptomoneda Bitcoin ha experimentado una ligera caída del -2.25%, lo que refleja una fase de corrección en su valor. Sin embargo, al observar su evolución en el último año, se destaca un crecimiento significativo del 25.32%, evidenciando la rentabilidad a largo plazo de esta criptomoneda a pesar de las fluctuaciones a corto plazo.\nEn la última semana, la cotización de la criptomoneda Bitcoin ha experimentado una ligera caída del -2.25%, lo que refleja una fase de corrección en su valor. Sin embargo, al observar su evolución en el último año, se destaca un crecimiento significativo del 25.32%, evidenciando la rentabilidad a largo plazo de esta criptomoneda a pesar de las fluctuaciones a corto plazo.\nLa volatilidad económica de Bitcoin en la última semana ha sido del 23.84%, lo que indica que su comportamiento es mucho más estable en comparación con la volatilidad anual del 40.64%.\nLa volatilidad económica de Bitcoin en la última semana ha sido del 23.84%, lo que indica que su comportamiento es mucho más estable en comparación con la volatilidad anual del 40.64%.\nDurante los últimos 12 meses, elBitcoinha llegado a costar en elmercado españolen un máximo de 144.026,2 euros mientras que su nivel más bajo ha sido 83.257,2 euros.",
    "url": "https://www.cronista.com/espana/criptomonedas-es/bitcoin-a-cuanto-cotiza-este-domingo-31-de-agosto/",
    "source": "El Cronista",
    "published_at": "Actualizado el   31 de Agosto de 202515:08",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "cd31590d2ace91e2d3d9ad4afedc4e90",
    "title": "Litecoin: a cuánto cotiza este domingo 31 de agosto",
    "description": "Criptomonedas",
    "content": "Este domingo, 31 de agosto de 2025 en España, la cotización delLitecoiny eleuroes de128,94 euros, cifra que refleja una variación del 0,43% en comparación con el día pasado.\nLa tendencia del precio del Litecoin y el euro ha sido positiva en los últimos días, con un dato de 1 superior a cero. Esto indica un crecimiento sostenido en su valor.Este aumento sugiere un interés creciente en Litecoin, lo que podría estar impulsando su demanda y valor en el mercado.\nLa tendencia del precio del Litecoin y el euro ha sido positiva en los últimos días, con un dato de 1 superior a cero. Esto indica un crecimiento sostenido en su valor.\nEste aumento sugiere un interés creciente en Litecoin, lo que podría estar impulsando su demanda y valor en el mercado.\nLa criptomoneda Litecoin ha experimentado una evolución mixta en su cotización, con una ligera disminución del -2.22% en la última semana, lo que sugiere cierta volatilidad a corto plazo. Sin embargo, al observar el rendimiento a largo plazo, se destaca un crecimiento del 22.73% en el último año, lo que indica una tendencia positiva y una rentabilidad atractiva para los inversores que han mantenido su posición en el tiempo.\nLa criptomoneda Litecoin ha experimentado una evolución mixta en su cotización, con una ligera disminución del -2.22% en la última semana, lo que sugiere cierta volatilidad a corto plazo. Sin embargo, al observar el rendimiento a largo plazo, se destaca un crecimiento del 22.73% en el último año, lo que indica una tendencia positiva y una rentabilidad atractiva para los inversores que han mantenido su posición en el tiempo.\nLa volatilidad económica de Litecoin en la última semana es del 30.04%, lo que es significativamente menor que la volatilidad anual del 68.45%, lo que indica que su comportamiento es mucho más estable en el último año.\nDurante los últimos 12 meses, elLitecoinha llegado a cotizar en elmercado españolen un máximo de 152,9 euros mientras que su nivel más bajo ha sido 75,4 euros.",
    "url": "https://www.cronista.com/espana/criptomonedas-es/litecoin-a-cuanto-cotiza-este-domingo-31-de-agosto/",
    "source": "El Cronista",
    "published_at": "Actualizado el   31 de Agosto de 202515:08",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": null
    }
  },
  {
    "id": "40f7ba7c36759787a9c32add7252ee79",
    "title": "Tensión por el dólar: cuál es el nuevo precio que ahora anticipan en cuevas virtuales",
    "description": "Cotizaciones",
    "content": "\n\n\n\nElprecio deldólar oficialretrocede $ 10 este miércoles 27 agosto, bajo la expectante mirada del mercado. Así, la moneda estadounidense cotiza a$ 1.360para la venta y $ 1.320 para la compra en el Banco Nación. Por su parte, eldólar bluebaja $ 5 y se negocia a $ 1.355 para la venta y de $ 1.335 para la compra.\nMientras tanto, las cuevas virtuales y exchanges cripto operan preciosque hoy se encuentran en línea con las cotizaciones anteriores. En las plataformas digitales en línea se negocia la compraventa destablecoins, también conocidas comodólar cripto, y que muchos ven como una versión digital del tradicionaldólar blue. No obstante, su precio actual suele ubicarse en un intermedio entre el informal, el MEP y el oficial.\nLo cierto es que las stablecoins que más se usan en la Argentina son las quesiguen el valor del dólar en una relación 1 a 1, como USDT o DAI. Gracias a esto, representan una opción digital de fácil adopción para dolarizar los ahorros.\nMuchos ahorristas creen que lascotizaciones de lasstablecoinsson untermómetro clavea seguir, dado que anticipa los movimientos futuros del tipo de cambio, sobre todo deldólar blue, en el país. A continuación, los detalles.\nEldólar cripto USDTcotiza este miércoles a$ 1.363,5en el popular exchange Binance, alrededor de las 15.55 hs.\nDe esta manera, el precio del dólar cripto se ubica por encima del deldólaroficial ($ 1.360), del dólar blue ($ 1.355) y del MEP ($1.359).\nLos valores varían entre distintos exchanges o cuevas virtuales y, según señala CriptoYa, las cotizaciones pueden estar entre los$ 1.360y los$ 1.390.\nUSDT (Tether)es, hoy en día, la stablecoin más aceptada del mercado cripto, además de ser la que goza de unmayor nivel de comercializaciónentre los ahorristas en la Argentina. De hecho, su volumen se encuentra incluso por encima de Bitcoin y Ethereum.\nSe puede comprar el \"dólar cripto\" USDTen cualquier cantidad y momento del día, además de que mantiene una relación 1:1 con el dólar. Por eso, son varios los analistas que consideran que su cotización refleja la demanda real y la confianza enel dólarcomo una moneda más estable y fiable en comparación con el peso argentino.\nHay que considerar que, en ocasiones como elecciones y otros eventos significativos que ocurrieron cuando el mercado del dólar blue está cerrado, los movimientos de stablecoins comoUSDTyDAIanticiparon lo que ocurriría con la cotización deldólar blue.",
    "url": "https://www.cronista.com/infotechnology/finanzas-digitales/tension-por-el-dolar-cual-es-el-nuevo-precio-que-ahora-anticipan-en-cuevas-virtuales/",
    "source": "El Cronista",
    "published_at": "Actualizado el   27 de Agosto de 202515:57",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "ccc1aced91c42e671be0d36fe2c5e362",
    "title": "¿Se dispara Bitcoin? La nueva proyección de este pionero cripto que entusiasma al mercado",
    "description": "Criptomonedas",
    "content": "\nBitcoin (BTC)atraviesa un agosto con ciertos altibajos. La principalcriptomonedadel ecosistema financiero alcanzó su pico máximo (u$s124,457.12) el miércoles 13 de este mes, aunque no logró sostener su tendencia al alza.\nTal es así que el activo estrella retrocedió durante los últimos días yse estancó por debajo de losu$s 110.000, cotizando este martes en la zona de losu$s 109.000.\n\"Estas correcciones son comunes y forman parte de un ciclo natural del mercado. Sin embargo, tras esta fase, se prevé un fuerte impulso alcista: Bitcoin podríaalcanzar niveles cercanos a los u$s 131.000, lo que representaría un crecimiento superior al 25% desde los precios actuales\", explicóJacobo Maximiliano, analista de Bitget.\nY remarcó: \"Este escenario optimista se sustenta también en factores macroeconómicos actuales. En Estados Unidos,la reciente estabilidad en los indicadores de inflación ha generado expectativas de una pausa o desaceleración en los incrementos de las tasas de interés por parte de la Reserva Federal (Fed), lo que suele ser positivo para activos de riesgo como las criptomonedas\".\nBajo este contexto,Michael Saylor, cofundador y presidente deStrategy, una de las empresas favoritas del mundo cripto, lanzó unanueva proyección sobre el precio de Bitcoin.\nDurante una reciente entrevista conCNBC, el empresario aseguró que la monedapodría incrementar su valor un 30% anual en los próximos 20 años. Es que, según argumentó, su vaticinio se ampara en tres aspectos clave:la escasez,transparencia y accesibilidad global de BTC. A su vez, resaltó que la oferta está limitada a21 millones de monedas, siendo el criptoactivo líder a nivel mundial.\n\nIncluso, hace algunas semanas, el gurú cripto también había recomendado a los inversores que\"ignoren a los osos\"-quienes creen que los precios van a caer y buscan beneficiarse de esa tendencia-,obvien la volatilidad de la criptomoneda y centren su foco a largo plazo.\n\"Bitcoin está en oferta\", afirmó Saylor en un posteo en su cuenta de X (exTwitter), en el que brindó pistas sobre una nueva compra que realizó su compañía.",
    "url": "https://www.cronista.com/infotechnology/finanzas-digitales/se-dispara-bitcoin-la-nueva-proyeccion-de-michael-saylor-que-entusiasma-al-mercado/",
    "source": "El Cronista",
    "published_at": "Actualizado el   27 de Agosto de 202508:27",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "6bb4c4d67700c6e3bddacdc7b7f901dd",
    "title": "Expectativa por el dólar: cuál es el nuevo precio que ahora anticipan en cuevas virtuales",
    "description": "Cotizaciones",
    "content": "\n\n\n\nElprecio deldólar oficialse mantiene estable este martes 26 agosto, bajo la tensa mirada del mercado. Así, la moneda estadounidense cotiza a$ 1.370para la venta y $ 1.330 para la compra en el Banco Nación. Por su parte, eldólar bluebaja $ 5 y se negocia a $ 1.360 para la venta y de $ 1.340 para la compra.\nEn tanto, las cuevas virtuales y exchanges cripto operan preciosque hoy se encuentran en línea con las cotizaciones anteriores. En las plataformas digitales en línea se negocia la compraventa destablecoins, también conocidas comodólar cripto, y que muchos ven como una versión digital del tradicionaldólar blue. No obstante, su precio actual suele ubicarse en un intermedio entre el informal, el MEP y el oficial.\nDe hecho, las stablecoins que más se usan en la Argentina son las quesiguen el valor del dólar en una relación 1 a 1, como USDT o DAI. Gracias a esto, representan una opción digital de fácil adopción para dolarizar los ahorros.\nMuchos ahorristas consideran que lascotizaciones de lasstablecoinsson untermómetro clavea seguir, dado que anticipa los movimientos futuros del tipo de cambio, sobre todo deldólar blue, en el país. A continuación, los detalles.\nEldólar cripto USDTcotiza este martes a$ 1.364,9en el popular exchange Binance, alrededor de las 17.20 hs.\nDe esta manera, el precio del dólar cripto se ubica por debajo del deldólaroficial ($ 1.370), pero por encima del dólar blue ($ 1.360) y del MEP ($1.354).\nLos valores varían entre distintos exchanges o cuevas virtuales y, según señala CriptoYa, las cotizaciones pueden estar entre los$ 1.360y los$ 1.390.\nUSDT (Tether)es, hoy en día, la stablecoin más aceptada del mercado cripto, además de ser la que goza de unmayor nivel de comercializaciónentre los ahorristas en la Argentina. De hecho, su volumen se encuentra incluso por encima de Bitcoin y Ethereum.\nSe puede comprar el \"dólar cripto\" USDTen cualquier cantidad y momento del día, además de que mantiene una relación 1:1 con el dólar. Por eso, son varios los analistas que consideran que su cotización refleja la demanda real y la confianza enel dólarcomo una moneda más estable y fiable en comparación con el peso argentino.\nHay que considerar que, en ocasiones como elecciones y otros eventos significativos que ocurrieron cuando el mercado del dólar blue está cerrado, los movimientos de stablecoins comoUSDTyDAIanticiparon lo que ocurriría con la cotización deldólar blue.",
    "url": "https://www.cronista.com/infotechnology/finanzas-digitales/expectativa-por-el-dolar-cual-es-el-nuevo-precio-que-ahora-anticipan-en-cuevas-virtuales-6298/",
    "source": "El Cronista",
    "published_at": "Actualizado el   26 de Agosto de 202517:23",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "1cd8baae3c4fb69b53305ef15883944a",
    "title": "Fuerte suba del dólar: cuál es el nuevo precio que ahora anticipan en cuevas virtuales",
    "description": "Cotizaciones",
    "content": "\n\n\n\nElprecio deldólar oficialsube $ 35 este lunes 25 agosto, bajo la tensa mirada del mercado. Así, la moneda estadounidense cotiza a$ 1.370para la venta y $ 1.330 para la compra en el Banco Nación. Por su parte, eldólar bluesube $ 20 y se negocia a $ 1.365 para la venta y de $ 1.345 para la compra.\nPor su parte, las cuevas virtuales y exchanges cripto operan preciosque hoy se encuentran en línea con las cotizaciones al alza. En las plataformas digitales en línea se negocia la compraventa destablecoins, también conocidas comodólar cripto, y que muchos ven como una versión digital del tradicionaldólar blue. No obstante, su precio actual suele ubicarse en un intermedio entre el informal, el MEP y el oficial.\nDe hecho, las stablecoins que más se usan en la Argentina son las quesiguen el valor del dólar en una relación 1 a 1, como USDT o DAI. Gracias a esto, representan una opción digital de fácil adopción para dolarizar los ahorros.\nMuchos ahorristas consideran que lascotizaciones de lasstablecoinsson untermómetro clavea seguir, dado que anticipa los movimientos futuros del tipo de cambio, sobre todo deldólar blue, en el país. A continuación, los detalles.\nEldólar cripto USDTcotiza este lunes a$ 1.360en el popular exchange Binance, alrededor de las 14 hs.\nDe esta manera, el precio del dólar cripto se ubica por debajo deldólar blue($ 1.365), debajo del deldólaroficial ($ 1.370), pero por encima del MEP ($1.352).\nLos valores varían entre distintos exchanges o cuevas virtuales y, según señala CriptoYa, las cotizaciones pueden estar entre los$ 1.360y los$ 1.390.\nUSDT (Tether)es, en la actualidad, la stablecoin más aceptada del mercado cripto, además de ser la que goza de unmayor nivel de comercializaciónentre los ahorristas en la Argentina. De hecho, su volumen se encuentra incluso por encima de Bitcoin y Ethereum.\nEs posible comprar el \"dólar cripto\" USDTen cualquier cantidad y momento del día, además de que mantiene una relación 1:1 con el dólar. Por eso, son varios los analistas que consideran que su cotización refleja la demanda real y la confianza enel dólarcomo una moneda más estable y fiable en comparación con el peso argentino.\nSe debe tener en cuenta que, en ocasiones como elecciones y otros eventos significativos que ocurrieron cuando el mercado del dólar blue está cerrado, los movimientos de stablecoins comoUSDTyDAIanticiparon lo que ocurriría con la cotización deldólar blue.",
    "url": "https://www.cronista.com/infotechnology/finanzas-digitales/fuerte-suba-del-dolar-cual-es-el-nuevo-precio-que-ahora-anticipan-en-cuevas-virtuales/",
    "source": "El Cronista",
    "published_at": "Actualizado el   25 de Agosto de 202514:03",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "dc6f86b0c610247e1dd6a8e60dbff645",
    "title": "Bitcoin: a cuánto cotiza este sábado 30 de agosto",
    "description": "Mundo cripto",
    "content": "La cotización de la criptomonedaBitcoiny eleurode este sábado, 30 de agosto de 2025 en España es de127.142,25 euros. En base a este precio, la variación de dicho activo digital en comparación con el día pasado es de 0,4%.\nEl precio del Bitcoin ha mostrado una tendencia positiva en los últimos días, mientras que el euro ha mantenido una tendencia estable. Esto sugiere que el interés en Bitcoin está en aumento, mientras que el euro no presenta cambios significativos en su valor.\nEn la última semana, la cotización de Bitcoin ha experimentado una ligera caída del -1.4%, lo que refleja una fase de corrección en su valor. Sin embargo, al observar su evolución en el último año, se destaca un crecimiento significativo del 25.48%, evidenciando la rentabilidad a largo plazo de esta criptomoneda. A pesar de las fluctuaciones a corto plazo, Bitcoin continúa siendo una opción atractiva para los inversores que buscan aprovechar su potencial de apreciación.\nEn la última semana, la cotización de Bitcoin ha experimentado una ligera caída del -1.4%, lo que refleja una fase de corrección en su valor. Sin embargo, al observar su evolución en el último año, se destaca un crecimiento significativo del 25.48%, evidenciando la rentabilidad a largo plazo de esta criptomoneda. A pesar de las fluctuaciones a corto plazo, Bitcoin continúa siendo una opción atractiva para los inversores que buscan aprovechar su potencial de apreciación.\nLa volatilidad económica de Bitcoin en la última semana ha sido del 29.23%, lo que indica que su comportamiento es mucho más estable en comparación con la volatilidad anual del 40.69%.\nLa volatilidad económica de Bitcoin en la última semana ha sido del 29.23%, lo que indica que su comportamiento es mucho más estable en comparación con la volatilidad anual del 40.69%.\nDurante los últimos 12 meses, elBitcoinha llegado a cotizar en elmercado españolen un máximo de 144.026,2 euros mientras que su nivel más bajo ha sido 83.257,2 euros.",
    "url": "https://www.cronista.com/espana/criptomonedas-es/bitcoin-a-cuanto-cotiza-este-sabado-30-de-agosto/",
    "source": "El Cronista",
    "published_at": "Actualizado el   30 de Agosto de 202515:08",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "dc6f86b0c610247e1dd6a8e60dbff645",
    "title": "Bitcoin: a cuánto cotiza este sábado 30 de agosto",
    "description": "Mundo cripto",
    "content": "La cotización de la criptomonedaBitcoiny eleurode este sábado, 30 de agosto de 2025 en España es de127.142,25 euros. En base a este precio, la variación de dicho activo digital en comparación con el día pasado es de 0,4%.\nEl precio del Bitcoin ha mostrado una tendencia positiva en los últimos días, mientras que el euro ha mantenido una tendencia estable. Esto sugiere que el interés en Bitcoin está en aumento, mientras que el euro no presenta cambios significativos en su valor.\nEn la última semana, la cotización de Bitcoin ha experimentado una ligera caída del -1.4%, lo que refleja una fase de corrección en su valor. Sin embargo, al observar su evolución en el último año, se destaca un crecimiento significativo del 25.48%, evidenciando la rentabilidad a largo plazo de esta criptomoneda. A pesar de las fluctuaciones a corto plazo, Bitcoin continúa siendo una opción atractiva para los inversores que buscan aprovechar su potencial de apreciación.\nEn la última semana, la cotización de Bitcoin ha experimentado una ligera caída del -1.4%, lo que refleja una fase de corrección en su valor. Sin embargo, al observar su evolución en el último año, se destaca un crecimiento significativo del 25.48%, evidenciando la rentabilidad a largo plazo de esta criptomoneda. A pesar de las fluctuaciones a corto plazo, Bitcoin continúa siendo una opción atractiva para los inversores que buscan aprovechar su potencial de apreciación.\nLa volatilidad económica de Bitcoin en la última semana ha sido del 29.23%, lo que indica que su comportamiento es mucho más estable en comparación con la volatilidad anual del 40.69%.\nLa volatilidad económica de Bitcoin en la última semana ha sido del 29.23%, lo que indica que su comportamiento es mucho más estable en comparación con la volatilidad anual del 40.69%.\nDurante los últimos 12 meses, elBitcoinha llegado a cotizar en elmercado españolen un máximo de 144.026,2 euros mientras que su nivel más bajo ha sido 83.257,2 euros.",
    "url": "https://www.cronista.com/espana/criptomonedas-es/bitcoin-a-cuanto-cotiza-este-sabado-30-de-agosto/",
    "source": "El Cronista",
    "published_at": "Actualizado el   30 de Agosto de 202515:08",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "d4c797944b04509c0ecdf3e87b1355f7",
    "title": "Ripple: a cuánto cotiza este sábado 30 de agosto",
    "description": "Mundo cripto",
    "content": "La cotización del Ripple este sábado, 30 de agosto de 2025 a las 12 horas en España es de3,28 euros. Esta cifra refleja una variación del -0,55% en comparación con el día de ayer.\nEl precio del Ripple ha mostrado una tendencia positiva en los últimos días, mientras que el euro ha mantenido una tendencia estable. Esto sugiere que el Ripple está ganando valor en comparación con el euro, lo que podría indicar un aumento en la confianza de los inversores hacia esta criptomoneda.\nLa criptomoneda Ripple ha experimentado una evolución mixta en su cotización, con una ligera disminución del -2.16% en la última semana, lo que sugiere cierta volatilidad a corto plazo. Sin embargo, al observar su rendimiento en el último año, se destaca un crecimiento significativo del 38.9%, lo que indica una tendencia positiva a largo plazo y una rentabilidad atractiva para los inversores que han mantenido su posición en este activo digital.\nLa criptomoneda Ripple ha experimentado una evolución mixta en su cotización, con una ligera disminución del -2.16% en la última semana, lo que sugiere cierta volatilidad a corto plazo. Sin embargo, al observar su rendimiento en el último año, se destaca un crecimiento significativo del 38.9%, lo que indica una tendencia positiva a largo plazo y una rentabilidad atractiva para los inversores que han mantenido su posición en este activo digital.\nLa volatilidad económica de Ripple en la última semana es del 52.33%, lo que es menor que la volatilidad anual del 81.17%, lo que indica que su comportamiento es mucho más estable en el último año.\nDurante los últimos 12 meses, elRippleha llegado a valer en elmercado españolen un máximo de 4,2 euros mientras que su nivel más bajo ha sido 2 euros.",
    "url": "https://www.cronista.com/espana/criptomonedas-es/ripple-a-cuanto-cotiza-este-sabado-30-de-agosto/",
    "source": "El Cronista",
    "published_at": "Actualizado el   30 de Agosto de 202515:08",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "245424f15255904d9d1b4cd41e31cb00",
    "title": "Impuestos y licencias de conducir: CABA ahora acepta pagos en Bitcoin",
    "description": "Capital cripto",
    "content": "La Ciudad de Buenos Aires quiere convertirse en capital cripto de Argentina y la región. Por eso, anunció medidas que apuntan tanto a los usuarios como las empresas del sector. Vecinos y empresas que cobran sus ingresos en criptomonedas ya puedenpagar impuestos como el ABL o Patentes, al igual que trámites como licencias de conducir o multas de tránsito. Pero, además, el jefe de Gobierno Jorge Macri anunció incentivos fiscales para que billeteras y compañías de la industria se radiquen y desarrollen en la Ciudad.\nA meses de la organización de eventos cripto y blockchain globales en Buenos Aires, entre los que se destaca Devconnect, Macri se reunió con referentes de billeteras y anunció un paquete de iniciativas para fomentar al ecosistema.\n\"El objetivo es que la Ciudad sea líder mundial en cripto.Ya tenemos el capital humano y ahora estamos generando las herramientas al reducir la burocracia para facilitar el cumplimiento de los contribuyentes y acompañar la llegada de las nuevas empresas que se instalan acá\", sostuvo Macri.\nEn la Ciudad,10 mil personas cobran del exterior vía cripto o PayPal, en tanto crece el uso de PIX como medio de pago. En la Argentina hay más de 10 millones de cuentas cripto, el equivalente al 22% del volumen de Latinoamérica, según datos de 2024.\nUna publicación compartida por Jorge Macri (@jorgemacri)\n\n\nSi bien en la actualidad hay billeteras que hacen la conversión de cripto a pesos para pagar impuestos, ahorael gobierno de la Ciudad desarrollará una solución para que los usuarios puedan realizar pagos en criptosin importar desde qué billetera lo inician.\nNuevas medidas para modernizar el sistema tributario de la Ciudad: el objetivo es facilitar las inversiones extranjeras, innovar acompañando el crecimiento de nuevas industrias y posicionar a Buenos Aires como referente cripto en el mundo.pic.twitter.com/I1xAIXYcXx\nEn el encuentro participaron empresarios, CEO de billeteras, y representantes de ONG vinculadas con el ecosistema. Entre ellos, estuvieron Mario López, presidente de la Cámara Argentina de Fintech; Andrés Ondarra, director de Binance para Argentina y el Cono Sur; Maximiliano Raimondi, CFO de Lemon; Julián Colombo, senior director of Policy and Strategy South America de Bitso; Francisco Mayora, CFO de Koibanx; Manuel Beaudroit, cofundador y CEO de BELO; Alejandro Rothamel, director de Legal Affairs de Ripio; y Marco Chacin, manager de Relaciones Internacionales de Bitget.\n\"Le planteamos al Gobierno porteño dos temas: en primer lugar,que nos ayuden a interceder ante el Gobierno nacional para solucionar el tratamiento discriminatorio que tenemos en el impuesto al cheque por parte de ARCAy, en segundo lugar, quedamos a disposición también para seguir trabajando tanto con la Cámara de hoteles como de diversos comercios para empezar a promover también el uso de cripto, en función de los grandes eventos que se vienen ahora, como  el Devconnect, el Fintech Forum, Labitconf\", afirmó Colombo.\n\"La idea es seguir empujando iniciativas para que cripto sea parte del día a día de los porteños\", confió, por su parte, Beaudroit.\nLuiz Eduardo Abreu Hadad, Consultor e Investigador en Blockchain en Sherlock Communications , destacó la iniciativa: \"La incorporación de criptomonedas en trámites e impuestos ofrece más opciones a los ciudadanos y posiciona a Buenos Aires como una ciudad cripto-friendly, atrayendo a emprendedores y empresas tecnológicas. Iniciativas como esta generan confianza y consolidan al país como un laboratorio de transformación financiera en América Latina\".\n\nMacri resaltó que la economía digital es una parte esencial de un Estado moderno, ágil, eficiente e inteligente.\"Queremos que el talento encuentre un lugar para crecer, innovar y liderar sin obstáculos\", concluyó.",
    "url": "https://www.cronista.com/finanzas-mercados/caba-ya-se-pueden-pagar-impuestos-con-bitcoin-y-anuncian-mas-medidas/",
    "source": "El Cronista",
    "published_at": "Actualizado el   19 de Agosto de 202515:39",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "e87faa4d7cda771a53d37d8f6f470fa3",
    "title": "Stablecoins y Fintech en América Latina: de la promesa a la infraestructura estratégica",
    "description": "Opinión",
    "content": "La narrativa global sobre tecnología financiera en 2024 estuvo marcada por una paradoja: mientras lainversión en fintechcayó en la mayoría de los mercados, América Latina experimentó un crecimiento del 86% en la captación de capital. En paralelo, el universo de lasstablecoins,criptomonedasdiseñadas para mantener un valor estable, mayormente anclado al dólar, vivió un momento decisivo, con un mercado que superó los USD 210.000 millones y transacciones por USD 26,1 billones. Entender cómo se conectan estas dos tendencias es clave para anticipar la próxima fase de innovación financiera en la región.\nEl auge de lasfintech latinoamericanasen 2024 se explica, en parte, por la madurez de un grupo selecto de jugadores que han logrado escalar con modelos rentables y sostenibles. Casos comoNubank,UaláoMercado Pagodemuestran que es posible combinar crecimiento acelerado con márgenes saludables, diversificación de productos y expansión geográfica. En todos ellos hay undenominador común: una visión estratégica clara, un control riguroso de costos y la capacidad de responder a las necesidades de un mercado históricamente subatendido.\nEse mismo espíritu pragmático es el que está impulsando la adopción de stablecoins más allá delmundo cripto. Hasta hace poco, su uso real se limitaba a arbitrajes y trading en plataformas descentralizadas. Hoy, un 8% de las transacciones ya se destina a pagos y liquidación de activos del mundo real.\nLa irrupción de redes como el Circle Payments Network, que integra bancos globales y aspira a competir directamente con SWIFT, o estándares como x402 de Coinbase para habilitarpagos automatizadosentre agentes deinteligencia artificial, muestra que hablamos de infraestructura en construcción, no de meros experimentos.\nEn América Latina, las stablecoins tienen un terreno fértil. La región combina una alta penetración móvil, grandes poblaciones no bancarizadas y, en varios países, monedas locales sometidas avolatilidad e inflación. Esto explica por qué en corredores como Estados Unidos y México ya representan cerca del 10% de las remesas, o por qué en mercados como Turquía y Nigeria, con realidades cambiarias similares, los usuarios las mantienen on-chain para evitar costos de conversión y preservar valor. Argentina, con su contexto macroeconómico, es un candidato natural para ver casos de adopción acelerada, tanto en pagos como en tesorería corporativa.\nNo obstante, el potencial viene acompañado deretos estructurales. El valor incremental que ofrecen las stablecoins frente a las redes de pagos tradicionales sigue siendo limitado en el corto plazo. Si bien pueden lograr liquidaciones casi instantáneas y costos marginales en blockchain, las fricciones aparecen en la \"última milla\": rampas de entrada y salida con comisiones de hasta 7%, liquidez local insuficiente en ciertos mercados y un marco regulatorio todavía fragmentado. La trazabilidad inherente a latecnología blockchainofrece ventajas en transparencia, pero también carece de la metadata y las protecciones al consumidor de las redes bancarias consolidadas.\nEn el plano regulatorio, 2025 marca un punto de inflexión. En Estados Unidos, la administración Trump ha impulsado un giro que prioriza la claridad normativa sobre stablecoins, frenando el desarrollo de undólar digitaly estableciendo reglas precisas sobre reservas y supervisión. Europa avanza con la plena implementación de MiCA, y países como Brasil, referente global con su sistema PIX, podrían liderar un modelo híbrido donde las monedas estables coexistan con depósitos tokenizados ymonedas digitales de bancos centrales.\nEn este contexto, las stablecoins no deberían verse como una amenaza a la banca tradicional, sino como un catalizador de modernización.Bancosy procesadores de pago tienen la oportunidad de integrarlas en sus servicios, desde cuentas y tarjetas hasta soluciones de tesorería y comercio internacional, generando eficiencia y ampliando su propuesta de valor.\nEl futuro del dinero en la región no se definirá por la supremacía de un único formato, sino por la capacidad de orquestarun ecosistema donde monedas estables, depósitos tokenizados y monedas digitales de bancos centrales convivan y se complementen.",
    "url": "https://www.cronista.com/columnistas/stablecoins-y-fintech-en-america-latina-de-la-promesa-a-la-infraestructura-estrategica/",
    "source": "El Cronista",
    "published_at": "Actualizado el   14 de Agosto de 202518:19",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "a44cd72bc6f4412163a1fa71f0ddd7f3",
    "title": "¿El dólar blue se mantiene a la baja? Las cuevas virtuales ya anticipan un nuevo precio",
    "description": "Mercado de cambios",
    "content": "Eldólar blueencontró cierta calma en las primeras dos semanas de agosto. El tipo de cambio paralelo, que había registradoun salto de $ 120 en julio,perdió $ 15 en lo que va del mes, cotizando a$ 1300 para la compray$ 1320 para la venta.\nPor su parte, losexchanges criptoy lascuevas virtualesnegociancotizacionesque hoy se encuentran muy por encima del billete informal.\nJustamente, lasplataformas digitalesactualizan en todo momento los valores de lasstablecoins, conocidas en Argentina como \"dólar cripto\". Soncriptomonedasespecialmente diseñadas para minimizar la volatilidad mediante la vinculación con un activo más fuerte; sean metales preciosos, recursos naturales odinero fiat (dólar, euro, etc.).\nIncluso,en época de elecciones o cuando el mercado no opera, los movimientos de estas monedas (USDT,DAIoUSDC) suelen anticipar lo que podría suceder con elprecio del blue.\nEl dólar criptoUSDT (Tether)se encuentra este domingo 17 de agosto -cerca de las 12 horas- a$ 1329,83en el popular exchangeBinance. Por ende, se mantiene levemente por encima de la actual cotización del tipo de cambio informal.\nOtras plataformas, además,negocian precios que oscilanentre $ 1328 y $ 1369.De igual modo, mantienen cierta diferencia respecto al precio del blue.\n\n\n\n\nEn Argentina, las monedas digitales más negociadas son las quesiguen el precio del dólar (relación 1 a 1), siendo una gran alternativa para quienes pretendendolarizar sus ahorros.\nUSDT (Tether)es el activo más solicitado por los inversores. Incluso, ostenta un mayor nivel de comercialización queBitcoinyEthereum.\n\n\n\n\n\n\n\n\nA su vez, también se transformó en la primera moneda en presentar el concepto de unastablecoin atada al dólar.Se puedeconseguir sin restricciones y durante las 24 horas del día.\nPor otro lado, los analistas sostienen quela cotización del USDT refleja la demanda real y la confianza en eldólarcomo una moneda más estable y fiable.",
    "url": "https://www.cronista.com/infotechnology/finanzas-digitales/el-dolar-blue-se-mantiene-a-la-baja-las-cuevas-virtuales-ya-anticipan-un-nuevo-precio/",
    "source": "El Cronista",
    "published_at": "Actualizado el   17 de Agosto de 202512:00",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "8c62701ad5226c3601a29d8c12c09d29",
    "title": "Bajó el dólar y las cuevas virtuales marcan un nuevo precio para la divisa",
    "description": "Cotizaciones",
    "content": "\n\n\nElprecio deldólar oficialbajó fuerte esta semana. Así, la moneda estadounidense cotiza a$ 1310para la venta y$ 1270para la compra en el Banco Nación. Por su parte, eldólar bluese negocia a$ 1320para la venta y de$ 1300para la compra.\nEn tanto, las cuevas virtuales y exchanges cripto operan preciosque hoy se encuentran ligeramente por encima. En las plataformas digitales en línea se negocia la compraventa destablecoins, también conocidas comodólar cripto, y que muchas personas ven como una versión digital del tradicionaldólar blue. No obstante, su precio actual suele ubicarse en un intermedio entre el informal, el MEP y el oficial.\nActualmente, las stablecoins que más se usan en la Argentina son las quesiguen el valor del dólar en una relación 1 a 1, como USDT o DAI. Gracias a esto, representan una opción digital de fácil adopción para dolarizar los ahorros.\nMuchos ahorristas consideran que lascotizaciones de lasstablecoinsson untermómetro clavea seguir, dado que anticipa los movimientos futuros del tipo de cambio, sobre todo deldólar blue, en el país. A continuación, los detalles.\n\nEldólar cripto USDTcotiza este sábado a$ 1327,6en el popular exchange Binance.\nAsí, el precio del dólar cripto se ubica por encima deldólar blue($ 1320), al igual que deldólaroficial ($ 1310) y del MEP ($1298,2).\nLos valores varían entre distintos exchanges o cuevas virtuales y, según señala CriptoYa, las cotizaciones pueden estar entre los$ 1325y los$ 1328.\nUSDT (Tether)es, en la actualidad, la stablecoin más aceptada del mercado cripto, además de ser la que goza de unmayor nivel de comercializaciónentre los ahorristas en la Argentina. De hecho, su volumen se encuentra incluso por encima de Bitcoin y Ethereum.\nSe puede comprar el \"dólar cripto\" USDTen cualquier cantidad y momento del día, además de que mantiene una relación 1:1 con el dólar. Por eso, son varios los analistas que consideran que su cotización refleja la demanda real y la confianza enel dólarcomo una moneda más estable y fiable en comparación con el peso argentino.\nHay que tener en cuenta que, en ocasiones como elecciones y otros eventos significativos que ocurrieron cuando el mercado del dólar blue está cerrado, los movimientos de stablecoins comoUSDTyDAIanticiparon lo que ocurriría con la cotización deldólar blue.",
    "url": "https://www.cronista.com/finanzas-digitales/bajo-el-dolar-y-las-cuevas-virtuales-marcan-un-nuevo-precio-para-la-divisa/",
    "source": "El Cronista",
    "published_at": "Actualizado el   16 de Agosto de 202509:58",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "947e099e73ab10dafc7d092cc315aa67",
    "title": "Argentina, líder cripto: recibe casi el 50% de los pagos globales en stablecoins",
    "description": "Nuevo récord",
    "content": "Argentina se consolida como líder mundialen la adopción de criptomonedaspara cancelar de salarios y honorarios profesionales.Casi el 50% de los pagos globales realizados por empresas tiene como destino las cuentas de los trabajadores argentinos.\n\nEste nivel de concentración refleja la demanda internacional de talento local en sectores como tecnología, desarrollo de software, marketing, diseño y Web3 así como la capacidad del ecosistema argentino para manejar pagos internacionales de manera eficiente y segura. Así lo refleja un relevamiento hecho por Bitwage, una de las plataformas pioneras en pagos con criptos.\n\nEl salario promedio en Argentina pagado mediantecriptomonedassupera los u$s 1600, un 25% más que la media global, y el 75% de los profesionales prefiere cobrar en stablecoins, como USDT o USDC, frente a un promedio global del 45%.\nEste comportamiento demuestra que la elección de criptoactivos no depende exclusivamente dela histórica brecha cambiaria, sino de una combinación de madurez del mercado, conciencia financiera y cultura de autonomía sobre los ingresos.\n\nComo señalaFabiano Dias, international business developer de Bitwage: \"Hoy lo que importa ya no es solo ganarle al dólar, sino tener libertad financiera, privacidad y acceso inmediato a activos digitales estables\".\n\nLatinoamérica representa el 60% de los pagos procesados por la plataforma, y dentro de ese universo,Argentina concentra el 73%, lo que la consolida como epicentro regional de la cripto-nómina,seguida por Brasil (9%), Colombia, Bolivia y Venezuela.\nLa adopción local no se limita al volumen: \"Los argentinos manejan wallets descentralizadas y stablecoins como instrumentos cotidianos de ahorro y pago, una diferencia significativa respecto a otros mercados que aún perciben las criptomonedas con cautela o desconocimiento\".\n\n\nEl crecimiento de la cripto-nómina no es exclusivo de Argentina. Según DataIntelo, el mercado global de pagos salariales en criptomonedas superó los u$s 1480 millones en 2024, con una tasa de crecimiento anual estimada del 19%.\nAunque en muchos países aún genera dudas o es utilizado de forma marginal, en otros, como Argentina, se integró de manera estructural a la vida financiera/cotidiana, incluso sin incentivos cambiarios.\n\nCon un marco legal que aún presenta zonas grises y una economía digital que avanza más rápido que las regulaciones,el uso de criptomonedas para cobrar sueldos parece haber dejado de ser una solución de emergenciapara transformarse en una decisión consciente, estratégica y cultural.\n\n\"Es impresionante cómo en Argentina el uso de stablecoins está completamente naturalizado, mucho más que en otros países de la región e incluso del mundo, donde todavía generan desconfianza o hasta incluso, hay desconocimiento de su existencia. Acá son parte de lo cotidiano. Muchos usuarios ya piensan directamente en USDT o USDC como una forma de ahorro o pago frecuente\", afirmó al respectoMaría Fernanda Juppet, CEO de CryptoMKT.\n\n\nEn declaraciones aEl Cronista, Dias explicó que, \"a medida que las monedas estables avanzan y se vuelven más fáciles de usar para compras en tiendas y puntos de venta,se convierte en una ventaja competitiva para una empresa pagar a sus empleados en dólares, ya sea total o parcialmente, en una moneda más segura que las de los países de Latinoamérica\".\n\nPor estas razones, el experto considera quela tendencia debería expandirse más allá de las empresas tecnológicas, especialmente las de Internet, hacia todos los sectores de la economía. Y no solo limitarse a las stablecoins, sino abarcar todo tipo de activos digitales que representen materias primas, productos financieros y acciones, e incluso a la propia empresa en formato digital o criptográfico, lo que hoy se conoce como RWA (Real World Assets o Activos del Mundo Real).\n\n¿Por qué los argentinos prefieren las criptomonedas incluso cuando ya no se trata solo de \"ganarle al dólar oficial\"? Desde Bitwage destacan un fenómeno cultural de fondo:la alta conciencia sobre la importancia de la libertad financiera y el valor de la privacidaden un país marcado por décadas de controles cambiarios, inflación e incertidumbre.\n\n\nEn este sentido, el acceso a \"wallets\" descentralizadas, sin procesos de identificación obligatorios (KYC), y el cobro directo en cripto representan una forma silenciosa pero potente de afirmar autonomía.No se trata solo de cómo cobrar, sino de cómo vivir y proteger los propios ingresos.\n\n\nEl caso argentino se inserta en un contexto global de crecimiento sostenido de la cripto-nómina. En paralelo,la adopción institucional de criptoactivos muestra un avance acelerado.\nSolo en julio, compañías que cotizan en bolsa compraron 49.000 BTC, por un total de u$s 5.800 millones, un balance de 955.000 Bitcoins, un crecimiento del 5% en un solo mes.\n\nEthereum y altcoins como SUI también comienzan a formar parte de las reservas corporativas, en lo que se denomina Crypto Treasuries. Por ejemplo: SharpLink Gaming adquirió 438.190 ETH, BitMine Immersion Technologies posee 600.000 ETH y Bit Digital convirtió u$s 172 millones en 100.603 ETH. Este movimiento evidencia la diversificación y maduración de las tesorerías corporativas hacia activos digitales.\n\nEstos datos fueron aportados a este medio por Matias Dajcz, CRO de Ripio, quien agregó, el sector DeFi también se encuentra en recuperación, con el Total Value Locked (TVL) al alcanzar cerca de u$s 178.000 millones, su nivel más alto en tres años.\nPlataformas como World Liberty Financial emite stablecoins y participa activamente en protocolos como AAVE y Ethereum, mientras Ripio Business consolida su posición en América Latina al ofrecer infraestructura segura y regulada para pagos y reservas en cripto. \"Más de 2.000 empresas de distintos sectores utilizan actualmente estos servicios, incluyendo casos de éxito como Mercado Pago (Brasil, México y Chile), IOL (Argentina) y OCA Blue (Uruguay)\", agregó Dajcz.",
    "url": "https://www.cronista.com/finanzas-mercados/argentina-recibe-casi-el-50-de-los-pagos-de-empresas-globales-en-criptomonedas/",
    "source": "El Cronista",
    "published_at": "Actualizado el   18 de Agosto de 202510:00",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "0334ef69993c13de6118991c922aafce",
    "title": "Baja el dólar y las cuevas virtuales ya anticipan un nuevo precio para la divisa",
    "description": "Cotizaciones",
    "content": "\n\n\nElprecio deldólar oficialbaja $ 15 este jueves 14 agosto, bajo la expectante mirada del mercado. Así, la moneda estadounidense cotiza a$ 1.310para la venta y $ 1.270 para la compra en el Banco Nación. Por su parte, eldólar bluebaja $ 20 y se negocia a $ 1.320 para la venta y de $ 1.300 para la compra.\nEn tanto, las cuevas virtuales y exchanges cripto operan preciosque hoy se encuentran ligeramente por debajo. En las plataformas digitales en línea se negocia la compraventa destablecoins, también conocidas comodólar cripto, y que muchos ven como una versión digital del tradicionaldólar blue. No obstante, su precio actual suele ubicarse en un intermedio entre el informal, el MEP y el oficial.\nLo cierto es que las stablecoins que más se usan en la Argentina son las quesiguen el valor del dólar en una relación 1 a 1, como USDT o DAI. Gracias a esto, representan una opción digital de fácil adopción para dolarizar los ahorros.\nMuchos ahorristas consideran que lascotizaciones de lasstablecoinsson untermómetro clavea seguir, dado que anticipa los movimientos futuros del tipo de cambio, sobre todo deldólar blue, en el país. A continuación, los detalles.\nEldólar cripto USDTcotiza este jueves a$ 1.315,9en el popular exchange Binance, alrededor de las 16.55 hs.\nAsí, el precio del dólar cripto se ubica por debajo deldólar blue($ 1.320), pero supera aldólaroficial ($ 1.310) y al MEP ($1.307).\nLos valores varían entre distintos exchanges o cuevas virtuales y, según señala CriptoYa, las cotizaciones pueden estar entre los$ 1.315y los$ 1.340.\nUSDT (Tether)es, en la actualidad, la stablecoin más aceptada del mercado cripto, además de ser la que goza de unmayor nivel de comercializaciónentre los ahorristas en la Argentina. De hecho, su volumen se encuentra incluso por encima de Bitcoin y Ethereum.\nSe puede comprar el \"dólar cripto\" USDTen cualquier cantidad y momento del día, además de que mantiene una relación 1:1 con el dólar. Por eso, son varios los analistas que consideran que su cotización refleja la demanda real y la confianza enel dólarcomo una moneda más estable y fiable en comparación con el peso argentino.\nHay que tener en cuenta que, en ocasiones como elecciones y otros eventos significativos que ocurrieron cuando el mercado del dólar blue está cerrado, los movimientos de stablecoins comoUSDTyDAIanticiparon lo que ocurriría con la cotización deldólar blue.",
    "url": "https://www.cronista.com/infotechnology/finanzas-digitales/baja-el-dolar-y-las-cuevas-virtuales-ya-anticipan-un-nuevo-precio-para-la-divisa/",
    "source": "El Cronista",
    "published_at": "Actualizado el   14 de Agosto de 202516:58",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "bfb9483f601bb28cbc6562ddc9d2be1c",
    "title": "Sube el dólar y las cuevas virtuales ya anticipan un nuevo precio para la divisa",
    "description": "Cotizaciones",
    "content": "\n\nElprecio deldólar oficialbaja este miércoles 13 agosto, bajo la inquieta mirada del mercado. Así, la moneda estadounidense cotiza a$ 1.325para la venta y $ 1.285 para la compra en el Banco Nación. Por su parte, eldólar bluesube $ 10 y se negocia a $ 1.340 para la venta y de $ 1.320 para la compra.\nEn tanto, las cuevas virtuales y exchanges cripto operan preciosque hoy se encuentran ligeramente por debajo. En las plataformas digitales en línea se negocia la compraventa destablecoins, también conocidas comodólar cripto, y que muchos ven como una versión digital del tradicionaldólar blue. No obstante, su precio actual suele ubicarse en un intermedio entre el informal, el MEP y el oficial.\nDe hecho, las stablecoins que más se usan en la Argentina son las quesiguen el valor del dólar en una relación 1 a 1, como USDT o DAI. Gracias a esto, representan una opción digital de fácil adopción para dolarizar los ahorros.\nMuchos ahorristas creen que lascotizaciones de lasstablecoinsson untermómetro clavea seguir, dado que anticipa los movimientos futuros del tipo de cambio, sobre todo deldólar blue, en el país. A continuación, los detalles.\nEldólar cripto USDTcotiza este miércoles a$ 1.324,3en el popular exchange Binance, alrededor de las 11.50 hs.\nAsí, el precio del dólar cripto se ubica por debajo deldólar blue($ 1.340) deldólaroficial ($ 1.325), aunque supera ligeramente al MEP ($1.318).\nLos valores varían entre distintos exchanges o cuevas virtuales y, según señala CriptoYa, las cotizaciones pueden estar entre los$ 1.324y los$ 1.355.\nUSDT (Tether)es, hoy en día, la stablecoin más aceptada del mercado cripto, además de ser la que goza de unmayor nivel de comercializaciónentre los ahorristas en la Argentina. De hecho, su volumen se encuentra incluso por encima de Bitcoin y Ethereum.\nEs posible comprar el \"dólar cripto\" USDTen cualquier cantidad y momento del día, además de que mantiene una relación 1:1 con el dólar. Por eso, son varios los analistas que consideran que su cotización refleja la demanda real y la confianza enel dólarcomo una moneda más estable y fiable en comparación con el peso argentino.\nSe debe tener en cuenta que, en ocasiones como elecciones y otros eventos significativos que ocurrieron cuando el mercado del dólar blue está cerrado, los movimientos de stablecoins comoUSDTyDAIanticiparon lo que ocurriría con la cotización deldólar blue.",
    "url": "https://www.cronista.com/infotechnology/finanzas-digitales/sube-el-dolar-y-las-cuevas-virtuales-ya-anticipan-un-nuevo-precio-para-la-divisa/",
    "source": "El Cronista",
    "published_at": "Actualizado el   13 de Agosto de 202514:48",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "0fbbd0d87291b71381079f1e3989f549",
    "title": "Ethereum coquetea con sus máximos históricos: por qué es el motor de la euforia cripto",
    "description": "Altcoins",
    "content": "Ethereumvolvió al centro de la escena del mercado cripto. Este miércoles, el token se mantiene por encima delos u$s 4700 y se encuentra a solo 3% de su máximo histórico de u$s 4878,26, con un aumento del6,1% en las últimas 24 horas.\nEste repunte no solo refleja un impulso alcista a corto plazo, sino también un interés creciente de inversores que buscan diversificación más allá de Bitcoin.\n\nEl movimiento se dio con un volumen de u$s 60.158 millones en una sola jornada, lo que indica participación activa del mercado y liquidez suficiente para sostener la suba.\nAdemás, Ethereum cotiza cerca de su máximo diario,lo que expone que la fuerza compradora domina el mercado y no se trata de un rebote técnico aislado. La capitalización de mercado de ETH alcanza losu$s 563.926 millones, y consolida su posición como la segunda criptomoneda más importante del mercado.\n\nUno de los factores que refuerza la narrativa de Ethereum es la rotación de capital desde Bitcoin. La dominancia de BTC cayó del 65% al 59% en los últimos dos meses, mientras que Bitcoin se mantiene en u$s 120.000 tras rebotar desde los u$s 112.000. Este escenario sugiere que parte de los inversores trasladó ganancias de Bitcoin hacia altcoins, lo que impulsó la suba de ETH y otras monedas de menor capitalización.\n\n\nLa combinación de un fuerte volumen, precios cerca de máximos diarios y una rotación de capital hacia altcoinsconfirma que Ethereum lidera la recuperación del mercado. Para inversores estratégicos, esta fase ofrece oportunidades de exposición a un activo con un presente sólido, respaldado por liquidez real y un interés creciente que podría sostener nuevos niveles de precio en el corto y mediano plazo.\n\nDesdeBuenbitsostienen que lo que sucede con Ethereum no es solo momentum: \"Hay demanda estructural vía vehículos regulados y, al mismo tiempo, menos ETH disponible para la venta. Esa combinación comprime la oferta y acelera los movimientos\", explicaron desde el Equipo de Research.\n\nSegún indican, en julio los productos institucionales de cripto registraron su máxima semana histórica de entradas (u$s 4,39 mil millones). \"Ethereum se robó el show' con u$s 2.12 mil millones en solo siete días. Estas participaciones se crean con la compra ETH al contado, lo que agrega presión compradora directa\".\n\nBuenbit Research aseguró: \"Cuando hay entradas netas en los ETF, los participantes autorizados compran ETH para crear nuevas cuotas del fondo. Con menos oferta suelta, la transmisión a precio se vuelve más rápida\".\n\nAl respecto,Pablo Monti,Brand Manager y Portavoz de BingX, señaló en declaraciones aEl Cronistaque la suba de la segunda mayor cripto por marketcap encuentra sustento en gran medida, por un aumento notable en el volumen de operaciones, un flujo institucional creciente de stablecoins y \"un contexto macroeconómico favorable\".\n\nMonti es claro: \"El movimiento no solo indica que ETH recupera terreno frente a BTC, sino que también podría preparar el terreno para registrar un nuevo máximo histórico\".Y es que diversos analistas identifican la zona de los u$s 4750 como resistencia clave antes de ir en busca de ese objetivo.\n\nPara el experto, la adopción institucional, el auge de DeFi y los avances en soluciones de capa 2 impulsan las expectativas de que ETH alcance un nuevo máximo histórico. \"Con un mercado favorable, la solidez de su red y el creciente número de desarrolladores refuerzan su papel como plataforma líder, y amplian su base de usuarios y su ventaja frente a competidores\", concluyó.\n\nDesde la perspectiva de capitalización, Ethereum mantiene con holgura el puesto como la segunda criptomoneda más relevante, con u$s 563.926 millones. El suministro circulante alcanza los u$s 120,7 millones de ETH, lo que coincide con la cantidad total emitida, lo que significa que no hay ETH adicional bloqueado que pueda alterar la dinámica de oferta inmediata, según datos de Sosovalue.\n\nSi el impulso alcista continúa, el próximo objetivo técnico para ETH se sitúa en la zona de u$s 4800-4900, mientras que soportes inmediatos se ubican en u$s 4500-4550.Los expertos señalan que, históricamente, movimientos diarios superiores al 5% en altcoins líderes suelen coincidir con rotaciones de capital hacia estos activos, un patrón que Ethereum parece repetir por estas horas.\nEn paralelo, Bitcoin muestra un avance más moderado, lo que enfatiza que los inversores viran su atención a oportunidades de crecimiento en la segunda mayor criptomoneda del mercado.\nDesde Lemon, señalaron que  el rally alcista de Ethereumdespertó el interés del mercado minorista en Argentina. \"Julio de 2025 fue el mes con mayor volumen operado de ETH en la historia de Lemon, con un 57% destinado a compras\", aseguraron.\nSegún el exchange de la City, en lo que va de agosto, la tendencia continúa: \"Ayer, el 12 de agosto, se alcanzó récord histórico diario de volumen operado de Ethereum, con un 62% correspondiente a compras\".",
    "url": "https://www.cronista.com/finanzas-mercados/ethereum-cerca-de-sus-maximos-historicos-por-que-es-el-motor-de-la-euforia-cripto/",
    "source": "El Cronista",
    "published_at": "Actualizado el   13 de Agosto de 202517:10",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "4f595fb7b48e9450d156a06141b8768f",
    "title": "Dos potencias militares se aliaron para controlar el Pacífico y tener una posición estratégica en la Tercera Guerra Mundial",
    "description": "Tensión",
    "content": "En medio de diferentesconflictos bélicosque atraviesan al mundo, losejércitos de China y Rusiahicieron una fuerte alianza para realizar una misión de patrullaje en elocéano Pacífico. El despliegue incluyósubmarinos de última generaciónde ataque de tipo diésel-eléctricos.\nLa \"cortina de hierro\" que Europa está construyendo para defenderse: teme que este país ataque y desate la Tercera Guerra Mundial\n¿Tercera Guerra Mundial? El Pentágono crea un escuadrón especial para proteger al país de drones asesinos\nLaFlota del Pacífico de Rusiay la Armada Naval de Chinarealizaron una inspección de forma conjunta que incluyó maniobras de navegación por elMar de Japón y el Mar de China Orientalcon submarinos de ataque.\nEn este sentido, se utilizó el poderoso submarino ruso Volkhov B-603, del Proyecto 636.3, de clase Kilo, el cualrecorrió más de 3.200 kilómetrosdesde su base en Vladivostok.\nDicho sumergible tienemisiles de crucero de ataque terrestre Kalibry torpedos de gran potencia y está preparado paramisiones de combatetanto en superficie como en el océano.\nLossubmarinos rusosy las unidades desplegadas por la Armada china operaron de manera coordinada con la corbeta rusa Gromkiy y el buqueantisubmarino Almirante Tributs. Además, brindaron servicios los destructores chinos Urumqi y Shaoxing, con buques auxiliares de apoyo.\nLa misión, por su parte,se planteó como un despliegue táctico y estratégicoen el Mar de Japón, lo que se conoce como una zona de una importante influencia militar por la presencia de naves estadounidenses en la región.\nEn ese sentido, la Agencia de Noticias de Rusia TASS, explicaron que el objetivo del patrullaje con los submarinos\"es fortalecer la cooperación naval entre los dos países, garantizar la paz y la estabilidad en la región Asia-Pacífico, monitorear el área yproteger las instalaciones económicas marítimas rusas y chinas\", subrayaron.\nEn tanto, la misión forma parte de un trabajo conjunto entre ambos ejércitos y quecomenzó a desplegarse en el año 2021, la cual tuvo 10 buques de guerra de la armada de Rusia y China, respectivamente.\nEn 2023 se puso en marcha unaalianza entre los ejércitos de China y Rusiapara hacer controles y patrullajes aéreos en diferentes regiones del Pacífico. Recientemente, un pelotón debombarderos estratégicos T-95MSde lasFuerzas Aeroespaciales rusasefectuaron una misión de patrullaje sobre aguas neutrales del mar de Japón.\nRespecto de las misiones conjuntas de los ejércitos, se llevó adelante el patrullaje Joint Sea-2025,las fuerzas de China y Rusia sobrevolaron la zona cercana de Vladivostok, lo cual se sumó a la Flota del Pacífico rusa.",
    "url": "https://www.cronista.com/informacion-gral/dos-potencias-militares-se-aliaron-para-controlar-el-pacifico-y-tener-una-posicion-estrategica-en-la-tercera-guerra-mundial/",
    "source": "El Cronista",
    "published_at": "Actualizado el   29 de Agosto de 202520:05",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": null
    }
  },
  {
    "id": "0fb8ebe930aeb08b4bf0daf967f62436",
    "title": "Confirmado | Cambia la hora: qué día hay que ajustar los relojes",
    "description": "Modificación",
    "content": "Chile se prepara para unnuevo cambio de hora en 2025,el segundo del año, que marca el fin del horario de invierno y el inicio del horario de verano. El ajuste buscaaprovechar mejor las horas de luz natural, aunque también genera debate por sus efectos en la salud y en la rutina diaria de los ciudadanos.\n\n\nEl cambio de hora se realizará el sábado 6 de septiembre de 2025 a las 23:59 horas. En ese momento, losrelojesdeberán adelantarse 60 minutos. Por lo tanto, la medianoche pasará directamente a ser la 01:00 del domingo 7 de septiembre.\n\nEste ajuste rige para todo el territorio continental, con excepción de las regiones australes de Aysén, Magallanes y la Antártica Chilena, que mantendrán su horario actual sin modificaciones.\n\nEn el territorio insular, en Isla de Pascua y las islas Salas y Gómez, el cambio se hará el mismo sábado, pero a las 22:00 horas locales.\nARCA | El Gobierno suspenderá todas las cuentas bancarias y tarjetas de crédito de los contribuyentes de esta lista\n\n\nEn esta ocasión, losrelojes se adelantan una hora. Con este ajuste, Chile continental quedará bajo el huso horario UTC-3, mientras que la Isla de Pascua quedará en UTC-5.\n\n\nEn la mayoría de los casos, los relojes de teléfonos móviles, tabletas y computadoras se ajustan automáticamente. Sin embargo, si el cambio no se aplica, se puede hacer de manera manual:\n\nAndroid: ingresar a Sistema o Administración general- Fecha y hora- desactivar Establecer hora automáticamente y Zona horaria automática. Ajustar manualmente.iPhone (iOS): ir a Configuración - General - Fecha y hora - desactivar Definir automáticamente y modificar la hora manualmente.\n\n\nDe acuerdo con el Decreto 224, el horario de verano comienza cada primer sábado de septiembre y termina el primer sábado de abril del año siguiente.\n\nPor lo tanto, el próximo cambio de hora será el sábado 4 de abril de 2026, cuando se deberá atrasar el reloj una hora para dar inicio nuevamente al horario de invierno.",
    "url": "https://www.cronista.com/internacionales/confirmado-cambia-la-hora-que-dia-hay-que-ajustar-los-relojes/",
    "source": "El Cronista",
    "published_at": "Actualizado el   30 de Agosto de 202513:10",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": null
    }
  },
  {
    "id": "344ac0647a392e8c74783a8358491179",
    "title": "Ordenan suspender en todos los supermercados el suplemento más popular por ser un producto falso",
    "description": "ANMAT",
    "content": "\nLaAdministración Nacional de Medicamentos, Alimentos y Tecnología Médica(ANMAT) prohibió la comercialización en todos lossupermercadosde unsuplementodietario porcarecer de registros de establecimiento y de producto.\nLa medida fue oficializada mediante laDisposición 6195/2025en el Boletín Oficial donde se informó que se trata de un productosin el etiquetado reglamentario, lo que implicauna falta grave a la normativa vigentey, por tanto, lo vuelve unproducto ilegal.\nTras una investigación que determinó las irregularidades en el rotulado, elorganismo de controlordenó el retiro del siguiente producto:\nProducto\nCreatina Monohidrato en polvo, durazno.\nMarca\nWolf Nutrition\nPeso Neto\n250 g\nVencimiento\nDiciembre 2026\nLote\n0100-20\nRNPA\nEX-2024-36557-GDEBA-DAYPANMG\nRNE\n02-050730\nDirección de elaboración\nRP 205 Km 80 - Cañuelas, Buenos Aires.\nLa ANMAT reveló que elRegistro Nacional de Establecimiento (RNE) y el Registro Nacional de Producto Alimenticio (RNPA)que se exhiben en el rótulo del producto \"son inexistentes\".\nDe esta forma, el organismo señaló queel insumo se encuentra en infracciónal artículo 3° de la Ley N° 18284, el artículo 3° del Anexo II del Decreto N° 2126/71, y a los artículos 6 bis, 13 y 155 delCódigo Alimentario Argentino (CAA).\nLaANMATresolvióprohibir la elaboración, fraccionamiento y comercializaciónen todo el territorio nacional y en plataformas de venta en línea del producto falsamente rotulado \"en cualquier presentación, lote y fecha de vencimiento\".\nAdemás, ordenó también ordenó suspender la comercialización en todo el territorio nacional de cualquier producto que en su rótulo indique elRNPA EX-2024-36557-GDEBA-DAYPANMG y/o el RNE 02-050730por ser un insumo falsamente rotulado.\nEs oficial: decretan feriado el lunes 1 de septiembre para dar lugar al primer y único fin de semana largo del mes\nDescubrimiento del siglo: cambia la historia de la humanidad tras el hallazgo de la fuente del agua de la vida\nLa ANMAT detalla en el anexo de sus resoluciones las diferencias existentes entre el producto original y las unidades falsificadas.\nLas alteraciones no solo radican en el registro, sino también en lasespecificaciones técnicasque se indican en el rotulado y en parte del texto. Por eso, para comprender el insumo, se deberá verificar eletiquetado original.\n\"En caso de contar con aquellas con las características descriptas, los usuarios deberáncontactarse con los entes de controla cargo vía mail o a través del sitioANMAT Responde\", sumaron.\nEl correo de contacto espesquisa@anmat.gob.ary en el mensaje se deberá detallar la situación completa confotos del rótulo.",
    "url": "https://www.cronista.com/informacion-gral/exigen-que-se-retire-urgente-este-suplemento-dietario-de-todos-los-supermercados-y-comercios-del-pais/",
    "source": "El Cronista",
    "published_at": "Actualizado el   29 de Agosto de 202509:28",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": null
    }
  },
  {
    "id": "61e65b7f89b773dea28f7ddba39fc5e6",
    "title": "Quién es Martín \"Tincho\" Ascúa, el referente del peronismo correntino que quedó por detrás de Juan Pablo Valdés",
    "description": "Elecciones",
    "content": "Martín Ignacio Ascúa, conocido como \"Tincho\", nació el 17 de noviembre de 1978 enPaso de los Libres, provincia de Corrientes. Es abogado, docente y político, y milita en el Partido Justicialista.\nEn estas elecciones se presentó como aspirante a gobernador para desbancar al oficialismo -Vamos Corrientes- que presentó aJuan Pablo Valdés, hermano deGustavo Valdés, actual mandatario provincial.\nCabe destacar que en las elecciones, de suma relevancia para la provincia, el peronista -fue por Limpiar Corrientes- logró el 20,1% de los votos, y quedó por detrás del menor de los Valdés que se impuso con un 52,61%.\n\nDesde2017 se desempeña como intendente de Paso de los Libres, cargo en el que fue reelecto en 2021 con el 50,89% de los votos. Durante su gestión, impulsó obras de infraestructura, programas educativos con universidades nacionales y políticas sanitarias que fortalecieron la atención primaria en la ciudad.\n\n\nEn 2025, fue proclamadocandidato a gobernador por el frente Limpiar Corrientes, tras lograr la unidad de las corrientes internas del PJ. Recibió el respaldo público deCristina Fernández de Kirchner, quien lo acompañó en un acto en Paso de los Libres.\n\nDurante la campaña, Ascúa criticó duramente el modelo político provincial, al que calificó como una\"dinastía de poder sostenida por el nepotismo y la corrupción\". Expresó que Corrientes es una provincia rica en recursos, pero \"atada a una deuda social e institucional que se perpetúa desde hace décadas\".\n\nAscúa propone una provincia inclusiva, con desarrollo productivo, acceso a la educación superior, infraestructura turística y fortalecimiento del Estado como articulador entre sectores.\nAsimismo, se mostró crítico del sistema judicial y de seguridad, reclamando reformas profundas y mayor transparencia institucional.",
    "url": "https://www.cronista.com/economia-politica/quien-es-martin-tincho-ascua-el-referente-del-peronismo-correntino-que-quedo-por-detras-de-juan-pablo-valdes/",
    "source": "El Cronista",
    "published_at": "Actualizado el   31 de Agosto de 202522:15",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": null
    }
  },
  {
    "id": "76b6b0dbb52981c5963a16acaf012e9c",
    "title": "Máximo Kirchner compartió una foto de Cristina con el Indio Solari: \"A votar como si estuviera en la lista\"",
    "description": "Elecciones",
    "content": "A horas de cumplirse tres años del intento de magnicidio contra Cristina Kirchner, su hijo y diputado Máximo Kirchner difundió una imagen dela expresidenta junto a Carlos Indio' Solari, que generó repercusión inmediata en redes sociales.\n\"Les comparto un momento de un buen encuentro.A horas de cumplirse 3 años del atentado contra CFK y una única certeza: las imágenes que todas y todos vimos\", escribió Máximo junto a la fotografía, en la que se la ve a Cristina sonriente, en un gesto poco habitual en el ámbito público.\nLa publicación se interpretó como un guiño a la cercanía personal que la expresidenta mantiene con referentes culturales y figuras del rock argentino, consolidando una imagen más humana y cercana de la política.\nEl legislador aprovechó la ocasión para enviar un mensaje político en el marco de la recta final de las elecciones bonaerenses:\"Votar a conciencia, como si ella estuviera en la lista.Todos y todas a expresarse en las urnas. Esa es su instrucción\", subrayó. La frase refleja la estrategia de movilización del espacio que encabeza, enfatizando la continuidad del legado de Cristina Kirchner y su influencia en la política argentina aún desde la prisión domiciliaria por la causa Vialidad.\nLa publicación de la foto se suma a la reciente intervención de Cristina en un plenario de Fuerza Patria en Mar del Plata en apoyo a la postulación de Fernanda Raverta, dondecalificó al gobierno de Javier Milei como un \"fracaso anunciado\"y cuestionó la gestión económica de la administración actual. La imagen inédita con Solari refuerza la idea de Cristina no solo como dirigente política, sino como figura pública que mantiene vínculos con la cultura popular, una estrategia simbólica que puede conectar con sectores amplios del electorado.\nLa reacción de los seguidores fue inmediata: la publicación de Máximo Kirchner recibió miles de\"me gusta\"y comentarios destacando la cercanía de Cristina con la ciudadanía y la cultura. Analistas políticos señalan que este tipo de gestos visuales buscan reforzar la narrativa de una líder resiliente, capaz de superar ataques y mantenerse presente tanto en la política como en la esfera cultural argentina.",
    "url": "https://www.cronista.com/economia-politica/maximo-kirchner-compartio-una-foto-de-cristina-con-el-indio-solari-a-votar-como-si-estuviera-en-la-lista/",
    "source": "El Cronista",
    "published_at": "Actualizado el   31 de Agosto de 202521:56",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": null
    }
  },
  {
    "id": "674fbd3025e233fb41e6de3595fe6162",
    "title": "Se viene la batalla de PBA: los 49 días que pueden ser 49 años hasta el 26-O",
    "description": "Zoom editorial",
    "content": "Hay mucho en juego en laselecciones del próximo domingo. El lector podrá responder que ello pasa siempre en cada elección pero underrota amplia de LLA en PBA, cuatro puntos porcentuales o más, puede llevar al país nuevamente al casillero de inicio, como en los juegos de mesa. Sería ungolpe para el plan oficial, para el acuerdo con elFMI, para los mercados que no tienen incorporado ese escenario en los precios y provocarían que los 49 días hasta laselecciones del 26 de octubrepuedan asemejarse a 49 años.\n¿Es posible ese escenario?Ningún encuestador, de los pocos serios, lo descarta. Consultado uno de ellos porEl Cronista, señaló que recién el miércoles tendrán los resultados del último trabajo de campo. Laconfianza de Javier Mileiy del propioLuis Caputoen las últimas declaraciones públicas realizadas acerca del resultado enPBAhace suponer que elgobiernocuenta con relevamientos propios que dan sustento a esa confianza. No se entenderían sino esas declaraciones. Al contrario:la mejor manera de alentar a los simpatizantes de LLA a que vayan a votar es creando un escenario en el cual puede haber un triunfo del kirchnerismo, populismo, o peronismo.\nEse escenario tendríaimpacto inmediatoen los mercados con eldólaren el centro de la escena. ¿Servirán las bandas de flotación para contenerlo?¿Valdrá la pena mantener esas bandas de flotación?Estos interrogantes van a surgir de confirmarse ese escenario en los 49 días hasta el 26 de octubre. Y elmercadollevará a testear el tope de la banda para ver la reacción oficial.\nElausentismoserá la principal fuerza ganadora en la batalla de PBA. Tiene lógica: hay desencanto en buena parte de la sociedad. LoscandidatosdeFuerza Patriaestán en blanco y negro, renovación cero, y son más de los mismo, con todo lo que ello trae aparejado. Del lado de LLA, el desencanto viene,operación Ko no, por el impacto reciente de los audios, y de las altas tasas en pesos.La mitad de los bonaerenses quizás no se muevan de sus casas el próximo domingo. Y muchos de los que se muevandesconocen lo que se está votando.\nEl test es el de siempre: trasgobiernos populistas, asumen otros que apuntan a desactivar las bombas heredadas en poco tiempo y lograr el respaldo de lasociedaden las elecciones de medio término. A veces lo logran pero estallan otras bombas (no heredadas) después, como en lagestión Macri. Y luego vuelven otrosgobiernos populistasque vuelven a cavar y a enterrar más al país. Y así pasa la vida. En esta ocasión, primó el shock de entrada.Veremos cómo reacciona el paladar de los bonaerensesa las reformas introducidas y a los errores de gestión cometidos.\nFinal abierto.",
    "url": "https://www.cronista.com/columnistas/se-viene-la-batalla-de-pba-los-49-dias-que-pueden-ser-49-anos-hasta-el-26-o/",
    "source": "El Cronista",
    "published_at": "Actualizado el   31 de Agosto de 202521:48",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": null
    }
  },
  {
    "id": "b8b87429972b50e7e73dcccd3c7e05ba",
    "title": "¿Se viene una nueva ola de inflación? Qué anticipan los precios mayoristas",
    "description": "Cifras clave",
    "content": "Luego de que junio dejara unainflación mayoristadel 1,5%,julio -con la escalada del dólar- registró un salto al 2,8% mensual. El aumento estuvo \"dentro de lo esperado, considerando la suba del tipo de cambio oficial durante el mes\", indicaron los economistas de LCG. Entonces, ¿qué implica para los precios minoristas de agosto?\n\nPor un lado, losbienes importados aumentaron un 5,7% mensual(frente al 1,3% de aumento en junio) y contribuyeron con 0,4 pp a la variación general del índice, detallaron los analistas. \"En comparación con el mismo mes del año pasado, losimportadossubieron solo un 6%, y casi toda la variación se explica por el alza puntual de este mes\".\n\nPero también losproductos nacionales también aceleraron su crecimiento (+2,6% m/m vs. 1,7% en junio). \"Dentro de este grupo, los manufacturados subieron un 2,8%, impulsados principalmente por tres sectores transables: Petróleo (3,9% m/m), Químicos (4,3% m/m) y vehículos (3,7% m/m). Estos sectores aportaron alrededor de 1 pp a la variación general\", remarcó LCG en base a los datos que publicó el Instituto Nacional de Estadística y Censos (INDEC).\nLosprecios mayoristas acumularon un alza de 12,3% en los últimos sietemeses según detalló el Instituto oficial que, por otra parte, anunció ayer uncambio en la dirección del índice de precios al consumidor (IPC) a partir de septiembre.\n\nEn julio, en tanto, en el índice mayorista (IPIM) los productos primarios aumentaron un 2,1%, con un fuerte impulso de los productos agropecuarios, mientras que energía eléctrica subió un 1,7%.\n\n\"La inflación mayorista, que corresponde principalmente a productos transables,superó ampliamente a la inflación minorista de bienes(2,8% vs. 1,4%) por segundo mes consecutivo. Esto implica una reducción de los márgenes del comercio minorista\", remarcaron los economistas de la consultora LCG.\n\"Dado el nuevo esquema de tipo de cambio flotante entre bandas oficializado a mediados de abril,el dólar mayorista está expuesto a una mayor volatilidad\", indicaron los economistas de ACM. En ese marco, aclararon que los precios de los productos importados responden principalmente al tipo de cambio, la suba del dólar oficial entre el 15 de junio y el 15 de julio (en torno al 7,5%), lo que \"incidió en los incrementos observados en este capítulo y en el índice general\".\n\nSi se compara la evolución interanual de los precios mayoristas (20,9% a/a) y minoristas (36,6% a/a), los economistas advierten que \"el spread entre ambas es de15,7 puntos porcentuales\", lo que marca una variación cercana a 2,5 p.p. respecto el mes anterior. \"Con el dato de julio,ya es el doceavo mes consecutivo en donde los precios minoristas crecen por encima de los mayoristas\", remarcaron.\n\n\"Si bien algunas empresas minoristas podrían tener espacio para reducir sus márgenes debido a que en los meses anteriores habían ajustado los precios más que los costos (IPC bienes superior al IPIM),este aumento de costos podría empezar a impactar la rentabilidadde algunas de ellas. Algunos rubros de servicios podrían contar con más espaldas para contener subas de precios de bienes\", aseguraron.\n\"Los sectores que puedanrecomponer sus gananciaslo harán (en la medida que la actividad acompañe), por lo que es probable que esta aceleración del IPIM arrastre ciertos efectos sobre el IPC en los próximos meses\".\n\nLos costos en los próximos meses podrían verse impactados por nuevosaumentos de tarifas y la volatilidad del tipo de cambioen agosto, que, en promedio mensual, se encuentra por encima del nivel de julio, agregaron los analistas.\nPara agosto, los economistas prevén que la inflación volvería a rondar el 2% mensual, con cifras que van hasta el 2,5%. El dato de julio minorista fue del 1,9% y el Gobierno celebró que el pass-through, el traslado del salto del dólar a los precios, haya sido acotado.\nComo indicaron los economistas, con la menor demanda de los consumidores,el espacio para recomponer márgenes en la comercialización es acotado, lo que se suma a una mayor oferta y un cambio en la composición del consumo.",
    "url": "https://www.cronista.com/economia-politica/se-viene-una-nueva-ola-de-inflacion-lo-que-anticipan-los-precios-mayoristas-3953/",
    "source": "El Cronista",
    "published_at": "Actualizado el   31 de Agosto de 202520:03",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": null
    }
  },
  {
    "id": "66f08836c0a84ac2f35d6bfc19f056e2",
    "title": "Caen depósitos en dólares del Gobierno y surge una desmentida oficial",
    "description": "¿Intervención?",
    "content": "En las 11 ruedas que pasaron entre el 11 de agosto y el 27 de agosto losdepósitos del Tesoro en el Banco Central bajaron u$s 354 millones.\n\"Hasta hace un par de ruedas pensábamos que el descenso sostenido quizás se explicaba por el pago de obligaciones con organismos internacionales, considerando que el Tesoro enfrentaba pagos con organismos por un total de u$s 208 millones entre el 12 y el 21 de agosto, perolas últimas cifras ya son un fuerte indicio de otra cosa\", sospechan desde la consultora 1816.\nUno que no entiende que los dólares del FMI que tomó el Tesoro los tiene el BCRA producto de la recapitalización que se realizó con los desembolsos.No se ha usado ni un solo dólar del FMI del programa que comenzó en Abril.https://t.co/bIoIi92vE2\nPor la nueva norma del BCRA, los bancos suben los plazos fijos a casi 5% mensual\nAclaran que van cuatro de esas 11 ruedas en las que sucede algo muy peculiar, que difícilmente sea casualidad: lacaída de depósitos en dólares del Tesoro en el Central coincide de manera exacta con el aumento de depósitos en pesos del Tesoro en el BCRA.\n\"No podemos confirmar totalmente a partir de esto que elfisco haya estado vendiendo divisas, en el MULC y/o en el MEP, pero no encontramos otra explicación para que, en reiteradas oportunidades, el Tesoro pierda dólares y sume pesos por un monto diario equivalente\", señalan.\nLas operaciones de esas 4 ruedas suman u$s 133 millones,pero no descartan que las ventas hayan sido superiores, dada la caída de depósitos, que alcanzó los u$s 354 millones.\nFabio Saraniti, CEO de Win Securities, fue uno de los tantos operadores al que le llamó la atención la suba del volumen operado durante las últimas dos semanas en el MEP, lo cual es un indicio para él que elGobierno haya estado vendiendo AL30 en dólares, ya que normalmente se operan u$s 50 millones diarios y saltó a u$s 70 millones.\nEl analistaChristian Butelerdijo por la red X que, \"de ser cierto, no sería la primera vez queCaputo utiliza los dólares del FMI para contener el precio del dólar. Ese había sido el motivo por el cual el organismo pidió su remoción cuando era presidente del BCRA en el 2018\".\nEl secretario de Finanzas,Pablo Quirno, salió a responderle: \"Uno que no entiende que losdólares del FMI que tomó el Tesoro los tiene el BCRAproducto de la recapitalización que se realizó con los desembolsos.No se ha usado ni un solo dólar del FMI del programa que comenzó en abril\".\nEl economista oficialistaFederico Domínguezagregó: \"Si hubiera habido intervención del BCRA en el spot sería noticia, pero no la hubo.Si alguien compra es porque alguien vende. Así funciona el mercado\".",
    "url": "https://www.cronista.com/finanzas-mercados/el-gobierno-desmiente-que-haya-salido-a-vender-dolares/",
    "source": "El Cronista",
    "published_at": "Actualizado el   31 de Agosto de 202512:01",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": null
    }
  },
  {
    "id": "57fb7504a78302cddf8aa8f5a40cbb56",
    "title": "Tensión por el dólar blue hoy: este es el precio que anticipan en las cuevas virtuales",
    "description": "Mercado de cambios",
    "content": "En la última semana de agosto, eldólar blueperdió $ 45 y volvió a ubicarsemuy cerca de la zona de los $ 1300. Tal es así que el tipo de cambio paralelo cerró el mes a$ 1300 para la compray$ 1320 para la venta, registrando una caída de $ 15 respecto a julio.\nPor su parte, losexchanges criptoy lascuevas virtualesnegociancotizacionesque hoy se encuentran muy por encima del billete informal.\nJustamente, lasplataformas digitalesactualizan constantemente los valores de lasstablecoins, conocidas en Argentina como \"dólar cripto\". Soncriptomonedasespecialmente diseñadas para minimizar la volatilidad mediante la vinculación con un activo más fuerte; sean metales preciosos, recursos naturales odinero fiat (dólar, euro, etc.).\nAdemás, enépoca de eleccionesocuando el mercado no opera, los movimientos de estas monedas (USDT,DAIoUSDC) suelen anticipar lo que podría suceder con elprecio del blue.\nEl dólar criptoUSDT (Tether)se encuentra este domingo 31 de agosto -cerca de las 12 horas- a$ 1374,51en el popular exchangeBinance. Por lo tanto, se mantiene muy por encima de la actual cotización del tipo de cambio informal.\nOtras plataformas, además,negocian precios que oscilanentre $ 1372 y $ 1403.De igual modo, mantienen cierta diferencia respecto al precio del blue.\n\n\n\n\nEn Argentina, las monedas digitales más negociadas son las quesiguen el precio del dólar (relación 1 a 1), siendo una gran alternativa para quienes pretendendolarizar sus ahorros.\nUSDT (Tether)es el activo más solicitado por los inversores. Incluso, ostenta un mayor nivel de comercialización queBitcoinyEthereum.\n\n\n\n\n\n\n\n\nA su vez, también se transformó en la primera moneda en presentar el concepto de unastablecoin atada al dólar.Se puedeconseguir sin restricciones y durante las 24 horas del día.\nPor otro lado, los analistas sostienen quela cotización del USDT refleja la demanda real y la confianza en eldólarcomo una moneda más estable y fiable.",
    "url": "https://www.cronista.com/infotechnology/finanzas-digitales/tension-por-el-dolar-blue-hoy-este-es-el-precio-que-anticipan-en-las-cuevas-virtuales/",
    "source": "El Cronista",
    "published_at": "Actualizado el   31 de Agosto de 202512:00",
    "collected_at": "2025-09-01 02:53:57.974062",
    "extra": {
      "image_url": null
    }
  }
]