[
  {
    "id": "f968a8c03beee75ab68e4b60372ae127",
    "title": "Ethereum: a cuánto cotiza este sábado 30 de agosto",
    "description": "Mundo cripto",
    "content": "La cotización de la criptomonedaEthereumy eleurode este sábado, 30 de agosto de 2025 en España es de5.104,15 euros. En base a este precio, la variación de dicho activo digital en comparación con el día pasado es de 0,22%.\nEl precio del Ethereum y el euro ha mostrado una tendencia positiva en los últimos días. Esto indica que ambos activos están en un proceso de crecimiento sostenido.\nEn la última semana, la cotización de la criptomoneda Ethereum ha experimentado un leve descenso del -0.32%, lo que sugiere una estabilidad en su valor a corto plazo. Sin embargo, al observar su evolución en el último año, se destaca un notable incremento del 41.81%, evidenciando un crecimiento significativo y una rentabilidad atractiva para los inversores a largo plazo. Esta combinación de resultados refleja la volatilidad inherente al mercado de criptomonedas, así como el potencial de Ethereum como una opción de inversión sólida.\nEn la última semana, la cotización de la criptomoneda Ethereum ha experimentado un leve descenso del -0.32%, lo que sugiere una estabilidad en su valor a corto plazo. Sin embargo, al observar su evolución en el último año, se destaca un notable incremento del 41.81%, evidenciando un crecimiento significativo y una rentabilidad atractiva para los inversores a largo plazo. Esta combinación de resultados refleja la volatilidad inherente al mercado de criptomonedas, así como el potencial de Ethereum como una opción de inversión sólida.\nLa volatilidad económica de Ethereum en la última semana ha sido del 62.86%, lo que es mayor que la volatilidad anual del 62.69%, indicando que su comportamiento es inestable y presenta muchas variaciones.\nLa volatilidad económica de Ethereum en la última semana ha sido del 62.86%, lo que es mayor que la volatilidad anual del 62.69%, indicando que su comportamiento es inestable y presenta muchas variaciones.\nDurante los últimos 12 meses, elEthereumha llegado a costar en elmercado españolen un máximo de 5.610,7 euros mientras que su nivel más bajo ha sido 1.607,4 euros.",
    "url": "https://www.cronista.com/espana/criptomonedas-es/ethereum-a-cuanto-cotiza-este-sabado-30-de-agosto/",
    "source": "El Cronista",
    "published_at": "Actualizado el   30 de Agosto de 202515:09",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAmkAAAFbAQMAAAC05YuqAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAADFJREFUeJztwTEBAAAAwqD1T20IX6AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAOA0axUAAVNxUlUAAAAASUVORK5CYII="
    }
  },
  {
    "id": "b21a773b2a42347104b70962e40c1081",
    "title": "Bitcoin Cash: a cuánto cotiza este sábado 30 de agosto",
    "description": "Criptomonedas",
    "content": "Este sábado, 30 de agosto de 2025 en España, la cotización delBitcoin Cashy eleuroes de639,25 euros, cifra que refleja una variación del 3,04% en comparación con el día de ayer.\nLa tendencia del precio del Bitcoin Cash y el euro ha sido positiva en los últimos días, ya que el dato de 1 es positivo.Esto sugiere un aumento en el valor de ambos activos, lo que podría indicar un mayor interés del mercado o una recuperación económica.\nLa tendencia del precio del Bitcoin Cash y el euro ha sido positiva en los últimos días, ya que el dato de 1 es positivo.\nEsto sugiere un aumento en el valor de ambos activos, lo que podría indicar un mayor interés del mercado o una recuperación económica.\nEn la última semana, la cotización de Bitcoin Cash ha experimentado un leve cambio del 0.27%, lo que indica una estabilidad en su valor a corto plazo. Sin embargo, al analizar su evolución en el último año, se observa un crecimiento significativo del 37.4%, lo que refleja un aumento en la rentabilidad y el interés de los inversores en esta criptomoneda. Esta combinación de estabilidad reciente y crecimiento a largo plazo sugiere un potencial atractivo para quienes buscan diversificar su portafolio en el mercado de criptomonedas.\nEn la última semana, la cotización de Bitcoin Cash ha experimentado un leve cambio del 0.27%, lo que indica una estabilidad en su valor a corto plazo. Sin embargo, al analizar su evolución en el último año, se observa un crecimiento significativo del 37.4%, lo que refleja un aumento en la rentabilidad y el interés de los inversores en esta criptomoneda. Esta combinación de estabilidad reciente y crecimiento a largo plazo sugiere un potencial atractivo para quienes buscan diversificar su portafolio en el mercado de criptomonedas.\nLa volatilidad económica de la última semana de Bitcoin Cash, con un 55.12%, es menor que la volatilidad anual del 66.09%, lo que indica que su comportamiento es mucho más estable en el último año.\nLa volatilidad económica de la última semana de Bitcoin Cash, con un 55.12%, es menor que la volatilidad anual del 66.09%, lo que indica que su comportamiento es mucho más estable en el último año.\nDurante los últimos 12 meses, elBitcoin Cashha llegado a costar en elmercado españolen un máximo de 720,1 euros mientras que su nivel más bajo ha sido 293,6 euros.",
    "url": "https://www.cronista.com/espana/criptomonedas-es/bitcoin-cash-a-cuanto-cotiza-este-sabado-30-de-agosto/",
    "source": "El Cronista",
    "published_at": "Actualizado el   30 de Agosto de 202515:08",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "dc6f86b0c610247e1dd6a8e60dbff645",
    "title": "Bitcoin: a cuánto cotiza este sábado 30 de agosto",
    "description": "Mundo cripto",
    "content": "La cotización de la criptomonedaBitcoiny eleurode este sábado, 30 de agosto de 2025 en España es de127.142,25 euros. En base a este precio, la variación de dicho activo digital en comparación con el día pasado es de 0,4%.\nEl precio del Bitcoin ha mostrado una tendencia positiva en los últimos días, mientras que el euro ha mantenido una tendencia estable. Esto sugiere que el interés en Bitcoin está en aumento, mientras que el euro no presenta cambios significativos en su valor.\nEn la última semana, la cotización de Bitcoin ha experimentado una ligera caída del -1.4%, lo que refleja una fase de corrección en su valor. Sin embargo, al observar su evolución en el último año, se destaca un crecimiento significativo del 25.48%, evidenciando la rentabilidad a largo plazo de esta criptomoneda. A pesar de las fluctuaciones a corto plazo, Bitcoin continúa siendo una opción atractiva para los inversores que buscan aprovechar su potencial de apreciación.\nEn la última semana, la cotización de Bitcoin ha experimentado una ligera caída del -1.4%, lo que refleja una fase de corrección en su valor. Sin embargo, al observar su evolución en el último año, se destaca un crecimiento significativo del 25.48%, evidenciando la rentabilidad a largo plazo de esta criptomoneda. A pesar de las fluctuaciones a corto plazo, Bitcoin continúa siendo una opción atractiva para los inversores que buscan aprovechar su potencial de apreciación.\nLa volatilidad económica de Bitcoin en la última semana ha sido del 29.23%, lo que indica que su comportamiento es mucho más estable en comparación con la volatilidad anual del 40.69%.\nLa volatilidad económica de Bitcoin en la última semana ha sido del 29.23%, lo que indica que su comportamiento es mucho más estable en comparación con la volatilidad anual del 40.69%.\nDurante los últimos 12 meses, elBitcoinha llegado a cotizar en elmercado españolen un máximo de 144.026,2 euros mientras que su nivel más bajo ha sido 83.257,2 euros.",
    "url": "https://www.cronista.com/espana/criptomonedas-es/bitcoin-a-cuanto-cotiza-este-sabado-30-de-agosto/",
    "source": "El Cronista",
    "published_at": "Actualizado el   30 de Agosto de 202515:08",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": null
    }
  },
  {
    "id": "ccc1aced91c42e671be0d36fe2c5e362",
    "title": "¿Se dispara Bitcoin? La nueva proyección de este pionero cripto que entusiasma al mercado",
    "description": "Criptomonedas",
    "content": "\nBitcoin (BTC)atraviesa un agosto con ciertos altibajos. La principalcriptomonedadel ecosistema financiero alcanzó su pico máximo (u$s124,457.12) el miércoles 13 de este mes, aunque no logró sostener su tendencia al alza.\nTal es así que el activo estrella retrocedió durante los últimos días yse estancó por debajo de losu$s 110.000, cotizando este martes en la zona de losu$s 109.000.\n\"Estas correcciones son comunes y forman parte de un ciclo natural del mercado. Sin embargo, tras esta fase, se prevé un fuerte impulso alcista: Bitcoin podríaalcanzar niveles cercanos a los u$s 131.000, lo que representaría un crecimiento superior al 25% desde los precios actuales\", explicóJacobo Maximiliano, analista de Bitget.\nY remarcó: \"Este escenario optimista se sustenta también en factores macroeconómicos actuales. En Estados Unidos,la reciente estabilidad en los indicadores de inflación ha generado expectativas de una pausa o desaceleración en los incrementos de las tasas de interés por parte de la Reserva Federal (Fed), lo que suele ser positivo para activos de riesgo como las criptomonedas\".\nBajo este contexto,Michael Saylor, cofundador y presidente deStrategy, una de las empresas favoritas del mundo cripto, lanzó unanueva proyección sobre el precio de Bitcoin.\nDurante una reciente entrevista conCNBC, el empresario aseguró que la monedapodría incrementar su valor un 30% anual en los próximos 20 años. Es que, según argumentó, su vaticinio se ampara en tres aspectos clave:la escasez,transparencia y accesibilidad global de BTC. A su vez, resaltó que la oferta está limitada a21 millones de monedas, siendo el criptoactivo líder a nivel mundial.\n\nIncluso, hace algunas semanas, el gurú cripto también había recomendado a los inversores que\"ignoren a los osos\"-quienes creen que los precios van a caer y buscan beneficiarse de esa tendencia-,obvien la volatilidad de la criptomoneda y centren su foco a largo plazo.\n\"Bitcoin está en oferta\", afirmó Saylor en un posteo en su cuenta de X (exTwitter), en el que brindó pistas sobre una nueva compra que realizó su compañía.",
    "url": "https://www.cronista.com/infotechnology/finanzas-digitales/se-dispara-bitcoin-la-nueva-proyeccion-de-michael-saylor-que-entusiasma-al-mercado/",
    "source": "El Cronista",
    "published_at": "Actualizado el   27 de Agosto de 202508:27",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "6bb4c4d67700c6e3bddacdc7b7f901dd",
    "title": "Expectativa por el dólar: cuál es el nuevo precio que ahora anticipan en cuevas virtuales",
    "description": "Cotizaciones",
    "content": "\n\n\n\nElprecio deldólar oficialse mantiene estable este martes 26 agosto, bajo la tensa mirada del mercado. Así, la moneda estadounidense cotiza a$ 1.370para la venta y $ 1.330 para la compra en el Banco Nación. Por su parte, eldólar bluebaja $ 5 y se negocia a $ 1.360 para la venta y de $ 1.340 para la compra.\nEn tanto, las cuevas virtuales y exchanges cripto operan preciosque hoy se encuentran en línea con las cotizaciones anteriores. En las plataformas digitales en línea se negocia la compraventa destablecoins, también conocidas comodólar cripto, y que muchos ven como una versión digital del tradicionaldólar blue. No obstante, su precio actual suele ubicarse en un intermedio entre el informal, el MEP y el oficial.\nDe hecho, las stablecoins que más se usan en la Argentina son las quesiguen el valor del dólar en una relación 1 a 1, como USDT o DAI. Gracias a esto, representan una opción digital de fácil adopción para dolarizar los ahorros.\nMuchos ahorristas consideran que lascotizaciones de lasstablecoinsson untermómetro clavea seguir, dado que anticipa los movimientos futuros del tipo de cambio, sobre todo deldólar blue, en el país. A continuación, los detalles.\nEldólar cripto USDTcotiza este martes a$ 1.364,9en el popular exchange Binance, alrededor de las 17.20 hs.\nDe esta manera, el precio del dólar cripto se ubica por debajo del deldólaroficial ($ 1.370), pero por encima del dólar blue ($ 1.360) y del MEP ($1.354).\nLos valores varían entre distintos exchanges o cuevas virtuales y, según señala CriptoYa, las cotizaciones pueden estar entre los$ 1.360y los$ 1.390.\nUSDT (Tether)es, hoy en día, la stablecoin más aceptada del mercado cripto, además de ser la que goza de unmayor nivel de comercializaciónentre los ahorristas en la Argentina. De hecho, su volumen se encuentra incluso por encima de Bitcoin y Ethereum.\nSe puede comprar el \"dólar cripto\" USDTen cualquier cantidad y momento del día, además de que mantiene una relación 1:1 con el dólar. Por eso, son varios los analistas que consideran que su cotización refleja la demanda real y la confianza enel dólarcomo una moneda más estable y fiable en comparación con el peso argentino.\nHay que considerar que, en ocasiones como elecciones y otros eventos significativos que ocurrieron cuando el mercado del dólar blue está cerrado, los movimientos de stablecoins comoUSDTyDAIanticiparon lo que ocurriría con la cotización deldólar blue.",
    "url": "https://www.cronista.com/infotechnology/finanzas-digitales/expectativa-por-el-dolar-cual-es-el-nuevo-precio-que-ahora-anticipan-en-cuevas-virtuales-6298/",
    "source": "El Cronista",
    "published_at": "Actualizado el   26 de Agosto de 202517:23",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "1cd8baae3c4fb69b53305ef15883944a",
    "title": "Fuerte suba del dólar: cuál es el nuevo precio que ahora anticipan en cuevas virtuales",
    "description": "Cotizaciones",
    "content": "\n\n\n\nElprecio deldólar oficialsube $ 35 este lunes 25 agosto, bajo la tensa mirada del mercado. Así, la moneda estadounidense cotiza a$ 1.370para la venta y $ 1.330 para la compra en el Banco Nación. Por su parte, eldólar bluesube $ 20 y se negocia a $ 1.365 para la venta y de $ 1.345 para la compra.\nPor su parte, las cuevas virtuales y exchanges cripto operan preciosque hoy se encuentran en línea con las cotizaciones al alza. En las plataformas digitales en línea se negocia la compraventa destablecoins, también conocidas comodólar cripto, y que muchos ven como una versión digital del tradicionaldólar blue. No obstante, su precio actual suele ubicarse en un intermedio entre el informal, el MEP y el oficial.\nDe hecho, las stablecoins que más se usan en la Argentina son las quesiguen el valor del dólar en una relación 1 a 1, como USDT o DAI. Gracias a esto, representan una opción digital de fácil adopción para dolarizar los ahorros.\nMuchos ahorristas consideran que lascotizaciones de lasstablecoinsson untermómetro clavea seguir, dado que anticipa los movimientos futuros del tipo de cambio, sobre todo deldólar blue, en el país. A continuación, los detalles.\nEldólar cripto USDTcotiza este lunes a$ 1.360en el popular exchange Binance, alrededor de las 14 hs.\nDe esta manera, el precio del dólar cripto se ubica por debajo deldólar blue($ 1.365), debajo del deldólaroficial ($ 1.370), pero por encima del MEP ($1.352).\nLos valores varían entre distintos exchanges o cuevas virtuales y, según señala CriptoYa, las cotizaciones pueden estar entre los$ 1.360y los$ 1.390.\nUSDT (Tether)es, en la actualidad, la stablecoin más aceptada del mercado cripto, además de ser la que goza de unmayor nivel de comercializaciónentre los ahorristas en la Argentina. De hecho, su volumen se encuentra incluso por encima de Bitcoin y Ethereum.\nEs posible comprar el \"dólar cripto\" USDTen cualquier cantidad y momento del día, además de que mantiene una relación 1:1 con el dólar. Por eso, son varios los analistas que consideran que su cotización refleja la demanda real y la confianza enel dólarcomo una moneda más estable y fiable en comparación con el peso argentino.\nSe debe tener en cuenta que, en ocasiones como elecciones y otros eventos significativos que ocurrieron cuando el mercado del dólar blue está cerrado, los movimientos de stablecoins comoUSDTyDAIanticiparon lo que ocurriría con la cotización deldólar blue.",
    "url": "https://www.cronista.com/infotechnology/finanzas-digitales/fuerte-suba-del-dolar-cual-es-el-nuevo-precio-que-ahora-anticipan-en-cuevas-virtuales/",
    "source": "El Cronista",
    "published_at": "Actualizado el   25 de Agosto de 202514:03",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "dfc82eaf8ab64d9484f8695ecc510c96",
    "title": "Cómo el plan de EE.UU puede redefinir la criptoeconomía global y los desafíos a los que se enfrenta Trump",
    "description": "Opinión",
    "content": "Desde queDonald Trumpregresó a la presidencia de losEstados Unidos, elmundo cripto y los activos digitalespasaron a ser un tema de conversación recurrente en la política norteamericana.\nTal es así que días atrás el secretario del Tesoro, Scott Bessent, durante la presentación de un informe elaborado por el Grupo de Trabajo de la Casa Blanca sobre Mercados de Activos Digitales, manifestó que la administración anterior había creado un \"ejército anticripto\". En ese sentido, planteó que se libró una interminableguerra legal contra empresas legítimas, se amenazó coneliminar la minería de Bitcoiny se buscó masivamenteexcluir del sistema bancario a las empresas de activos digitales.\nEn este contexto, la nueva administración inició su mandato con la formación del mencionado grupo, donde Donald Trump suscribió una orden ejecutiva para asegurar elliderazgo norteamericano en la innovación blockchainy para mantener a Estados Unidos a la vanguardia deldesarrollo de activos digitales.\nDel extenso informe emitido titulado \"Strengthening American Leadership in Digital Financial Technology\" surge que las reformas para lograr el objetivo fijado por Trump son necesarias paramejorar la transparencia, la protección del consumidor y la innovación en el sector de los activos digitales.\nAdemás, entiende que laComisión de Bolsa y Valores (SEC)y a laComisión de Comercio de Futuros de Commodities (CFTC)son las instituciones reguladoras clave en el proceso, y propone ampliar las normas existentes y las entidades exentas para permitir el comercio de activos digitales.\nDentro de estas propuestas se incluye laampliación de la autoridad de la CFTC sobre los activos digitales no relacionados con valores, promover las finanzas descentralizadas y facilitar la negociación y el desarrollo de productos a través de herramientas regulatorias.\nEl grupo de trabajo también solicita modificar la normativa bancaria para apoyar los servicios de activos digitales; implementar laLey GENIUS-promulgada el mes pasado- pararegular las monedas estables; y garantizar la privacidad mediante la prohibición de las monedas digitales emitidas por bancos centrales.\nPromulgada el 18 de julio de 2025, laLey GENIUS(Guiding and Empowering National Innovation for United States Stablecoins Act) está dirigida exclusivamente a laspayment stablecoins.Esta norma marca un hito importante como laprimera legislación federal sobre criptomonedas en Estados Unidosque regula específicamente las stablecoins. En ella define quiénes pueden emitirlas, exige unrespaldo 1:1en activos auditables y obliga a publicar reportes periódicos sobre las reservas.\nAsimismo, autoriza la emisión por entidades privadas pero bajo una estricta regulación, requiriendo que esténrespaldadas íntegramente por efectivoo instrumentos de deuda altamente líquidos emitidos por la Reserva Federal.\nPor lo tanto esto termina vinculando a los emisores con el sistema bancario tradicional, convirtiéndolos en una suerte de \"bancos proxy\" y sometiéndolos a las leyes del secreto bancario (Bank Secrecy Act), con obligaciones de prevención de lavado y reporte de operaciones sospechosas bajo supervisión federal y estatal.\nLa ley excluye expresamente a las payment stablecoins del ámbito de la Ley de Valores y de la supervisión de la SEC, evitando duplicidades regulatorias. Esta posición fue confirmada por la SEC al precisar que no serán tratadas como valores si cumplen con los estándares requeridos, reafirmando su apoyo a un marco claro que fomente la innovación sin comprometer la estabilidad ni la protección a los consumidores.\nSi bien esta se presenta como una norma de estabilidad y protección al usuario, también busca fortalecerel rol del dólar como moneda digital globaly promover la compra de deuda pública, con la expectativa de impulsar un mercado de stablecoins de escala billonaria.\nA partir de la entrada en vigencia de esta ley, los proveedores de servicios de activos digitales, comoexchanges y billeteras,tendrán un período de transición detres años para adaptarse a la nueva normativa.\nLa Ley CLARITY establece unmarco regulatorio en Estados Unidos para los activos digitales no estables, complementando la Ley GENIUS. Su objetivo principal esclarificar la jurisdicción y las responsabilidades de la SEC y la CFTC, definiendo cuándo un activo digital debe considerarse un valor (regulado por la SEC) o una commodity (regulado por la CFTC).\nLa ley asigna roles específicos a cada agencia, refuerza la protección al consumidor y promueve la transparencia en los mercados, buscando un entorno coherente que fomente la innovación mientras protege a los participantes.\nEntre las recomendaciones adicionales del informe se incluyen actualizaciones sobre lalucha contra el blanqueo de capitales, orientación para el contribuyente y un tratamiento fiscal actualizado para los activos digitales con el fin de impulsar el crecimiento responsable de la criptoeconomía.\nEl informe exige un sistema de clasificación claro e integral, distinto de la estrategia que fue llevada a cabo por la administración anterior de \"regulación por aplicación\".\nEl informe recomienda un enfoque que se centre en la función económica de cada activo digital en particular, esto es reconociendo sus diferencias y segmentándolos en las categorías generales detokens de valor,tokens de materias primasy tokens para uso comercial y de consumo.\nLa tarea que más urge es habilitar en lo inmediatola negociación de activos digitales a nivel federal, garantizando la claridad en el registro, la custodia, la negociación y la gestión de registros, según indica el informe.\nLos activos digitales deben ser considerados como una nueva clase de activos, donde las leyes fiscales se adapten para regular cómo se gravan estas actividades y activos digitales, estableciendo nuevas reglas específicas para su tratamiento fiscal, y que la legislación defina claramente qué actividades relacionadas con activos digitales están permitidas en el ámbito bancario, incluyendo custodia, tokenización, emisión de monedas estables y uso de cadenas de bloques.\nEntre los aspectos más relevantes, el informe también solicitadirectrices para el Tesoro de los Estados Unidos y para el Servicio de Impuestos Internos (IRS)en materia de contabilidad financiera para abordar las ganancias y pérdidas no realizadas en criptomonedas; si las transacciones de staking, wrapping y unwrap son transacciones gravables; los ingresos mínimos o insignificantes de activos digitales (minimis), además de la actualización de la normativa del IRS sobre activos digitales.\nAsimismo, se recomienda crear una \"exención por innovación\" condicional que permita a los registrados en la SEC participar en modelos de negocio innovadores, y la normativa vigente debe modificarse para dar cabida a la negociación de activos digitales no relacionados con valores y a la tokenización de valores del sistema de mercado\nEl capítulo examina el marco tributario vigente para activos digitales en Estados Unidos y las áreas que requieren mayor precisión normativa. Parte de la premisa de que criptomonedas y otros activos digitales permiten transacciones complejas -contratos inteligentes, firmas múltiples, operaciones con garantías-, lo que dificulta aplicarles reglas fiscales tradicionales sin ajustes específicos.\nEl IRS considera a los activos digitales como propiedad, no como moneda. Por ello, su venta o intercambio genera ganancias o pérdidas de capital sujetas a declaración, siguiendo principios aplicables a acciones, inmuebles u otros bienes. No obstante, existe normativa ya establecida para ciertos casos particulares, como ser:\nSe refiere a una separación en la cadena de bloques que puede resultar en una nueva criptomoneda. Según la normativa que la regula, las bifurcaciones pueden tener implicaciones fiscales, considerando si se recibe alguna moneda o tokens en un fork y cómo se deben valorar para efectos fiscales en el momento de la recepción.\nImplica mantener fondos en una wallet para apoyar la operación de una red blockchain y obtener recompensas. La normativa en cuestión trata sobre la clasificación fiscal del staking, si las recompensas recibidas se consideran ingreso en el momento de la recepción, y cómo se valoran para efectos fiscales.\nEstos son activos digitales únicos que representan propiedad o derechos sobre contenidos digitales o físicos. La normativa que los regula proporciona orientación sobre su tratamiento fiscal, incluyendo la adquisición, transferencia y venta.\n\nEn materia dereportes,desde la Ley de Infraestructura de 2021 se obliga a ciertos brokers a informar operaciones ante el IRS. El pasado mes de abril el presidente Donald Trump firmo una ley quesuspendió la obligación de reporte para algunos desarrolladores y operadores de DeFi (no custodiales).Este cambio alivió significativamente el alcance de la regulación original sobre tecnología descentralizada.\nRespecto al Impuesto Mínimo Corporativo Alternativo (CAMT), creado para grandes compañías en 2022 mediante la Ley de reducción de la inflación, se advierte que podría gravar ganancias no realizadas de criptomonedas. El informe propone excluirlas del cálculo del Adjusted Financial Statement Income (AFSI). No obstante, en junio pasado el IRS emitió normativa provisional donde aclaro indica que, hasta que haya normativa final, las empresasno tienen que computar esas ganancias no realizadas de criptoen el cálculo del AFSI.\nTambién se pide definir el tratamiento fiscal del staking (poner en garantía criptoactivos para validar operaciones, luego se obtiene una recompensa) en fideicomisos de inversión (grantor trusts), para determinar si mantiene el estatus de \"investment trust\" o lo pierde. Es decir, si el IRS considera que esa recompensa es una renta pasiva o una actividad empresarial. Asimismo, se solicita claridad sobre el wrapping de tokens, proceso de convertir un token nativo en otro equivalente en otra blockchain, y si genera un hecho imponible.\nEn conclusión, se reclama la emisión de normas claras por parte del Tesoro y el IRS para dar certeza jurídica, evitar cargas fiscales indebidas y permitir que la industria crezca sin frenar la innovación.\nEn 2025, Estados Unidos avanza hacia unareconfiguración integral de su marco fiscal y regulatorio para activos digitales. El informe de la Casa Blanca \"Strengthening American Leadership in Digital Financial Technology\" establece un plan de adopción masiva que, junto con la entrada en vigor de la Ley GENIUS-reguladora de stablecoins- y laLey CLARITYpara mercados y servicios de activos digitales, proyecte unecosistema normativo con implicancias tributarias de gran alcance.\nLa estrategiano se limita a ordenar la emisión y uso de criptoactivos: busca definir estándares de transparencia que faciliten la fiscalización, el intercambio de información y la trazabilidad de operaciones, reduciendo espacios para la evasión y la opacidad.\nEn este sentido,Estados Unidos no solo fija reglas domésticas, sino que posiciona un modelo susceptible de ser replicado por otros países, marcando el ritmo para una eventual convergencia internacional en materia de tributación digital.\n\nPara las administraciones tributarias de todo el mundo,el desafío será adaptar sus marcos legales y sistemas de control a esta nueva dinámica, equilibrando incentivos a la innovación con mecanismos eficaces de recaudación y control fiscal. La cuestión ya no es si la economía de criptoactivos tendrá regulación fiscal, sino qué países lograrán implementarla a tiempo para sostener competitividad, seguridad jurídica y capacidad recaudatoria.",
    "url": "https://www.cronista.com/columnistas/como-el-plan-de-ee-uu-puede-redefinirla-criptoeconomia-global-y-los-desafios-a-los-que-se-enfrenta-trump/",
    "source": "El Cronista",
    "published_at": "Actualizado el   23 de Agosto de 202518:45",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "9a9fa4b840fd1f5c30ef4f71e9b45efe",
    "title": "Bitcoin: a cuánto cotiza este viernes 29 de agosto",
    "description": "Mundo cripto",
    "content": "La cotización del Bitcoin este viernes, 29 de agosto de 2025 a las 12 horas en España es de127.227,42 euros. Esta cifra refleja una variación del -2,95% en comparación con el día pasado.\nEl precio del Bitcoin ha mostrado una tendencia positiva en los últimos días, mientras que el euro ha mantenido una tendencia estable. Esto sugiere que el Bitcoin está ganando valor en comparación con su comportamiento reciente, mientras que el euro no presenta cambios significativos.\nEn la última semana, la cotización de la criptomoneda Bitcoin ha experimentado una caída del -4.4%, lo que refleja una tendencia a la baja en el corto plazo. Sin embargo, al analizar su evolución en el último año, se observa un aumento significativo del 25.57%, lo que indica que, a pesar de las fluctuaciones recientes, Bitcoin ha mantenido una rentabilidad positiva en el largo plazo, atrayendo así el interés de inversores y analistas en el mercado de criptomonedas.\nEn la última semana, la cotización de la criptomoneda Bitcoin ha experimentado una caída del -4.4%, lo que refleja una tendencia a la baja en el corto plazo. Sin embargo, al analizar su evolución en el último año, se observa un aumento significativo del 25.57%, lo que indica que, a pesar de las fluctuaciones recientes, Bitcoin ha mantenido una rentabilidad positiva en el largo plazo, atrayendo así el interés de inversores y analistas en el mercado de criptomonedas.\nLa volatilidad económica de Bitcoin en la última semana ha sido del 29.04%, lo que indica que su comportamiento es mucho más estable en comparación con la volatilidad anual del 40.68%.\nLa volatilidad económica de Bitcoin en la última semana ha sido del 29.04%, lo que indica que su comportamiento es mucho más estable en comparación con la volatilidad anual del 40.68%.\nDurante los últimos 12 meses, elBitcoinha llegado a valer en elmercado españolen un máximo de 144.026,2 euros mientras que su nivel más bajo ha sido 83.257,2 euros.",
    "url": "https://www.cronista.com/espana/criptomonedas-es/bitcoin-a-cuanto-cotiza-este-viernes-29-de-agosto/",
    "source": "El Cronista",
    "published_at": "Actualizado el   29 de Agosto de 202515:15",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "9a9fa4b840fd1f5c30ef4f71e9b45efe",
    "title": "Bitcoin: a cuánto cotiza este viernes 29 de agosto",
    "description": "Mundo cripto",
    "content": "La cotización del Bitcoin este viernes, 29 de agosto de 2025 a las 12 horas en España es de127.227,42 euros. Esta cifra refleja una variación del -2,95% en comparación con el día pasado.\nEl precio del Bitcoin ha mostrado una tendencia positiva en los últimos días, mientras que el euro ha mantenido una tendencia estable. Esto sugiere que el Bitcoin está ganando valor en comparación con su comportamiento reciente, mientras que el euro no presenta cambios significativos.\nEn la última semana, la cotización de la criptomoneda Bitcoin ha experimentado una caída del -4.4%, lo que refleja una tendencia a la baja en el corto plazo. Sin embargo, al analizar su evolución en el último año, se observa un aumento significativo del 25.57%, lo que indica que, a pesar de las fluctuaciones recientes, Bitcoin ha mantenido una rentabilidad positiva en el largo plazo, atrayendo así el interés de inversores y analistas en el mercado de criptomonedas.\nEn la última semana, la cotización de la criptomoneda Bitcoin ha experimentado una caída del -4.4%, lo que refleja una tendencia a la baja en el corto plazo. Sin embargo, al analizar su evolución en el último año, se observa un aumento significativo del 25.57%, lo que indica que, a pesar de las fluctuaciones recientes, Bitcoin ha mantenido una rentabilidad positiva en el largo plazo, atrayendo así el interés de inversores y analistas en el mercado de criptomonedas.\nLa volatilidad económica de Bitcoin en la última semana ha sido del 29.04%, lo que indica que su comportamiento es mucho más estable en comparación con la volatilidad anual del 40.68%.\nLa volatilidad económica de Bitcoin en la última semana ha sido del 29.04%, lo que indica que su comportamiento es mucho más estable en comparación con la volatilidad anual del 40.68%.\nDurante los últimos 12 meses, elBitcoinha llegado a valer en elmercado españolen un máximo de 144.026,2 euros mientras que su nivel más bajo ha sido 83.257,2 euros.",
    "url": "https://www.cronista.com/espana/criptomonedas-es/bitcoin-a-cuanto-cotiza-este-viernes-29-de-agosto/",
    "source": "El Cronista",
    "published_at": "Actualizado el   29 de Agosto de 202515:15",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "eedecfa68416be53153e5c047c3e7d92",
    "title": "Ethereum: a cuánto cotiza este viernes 29 de agosto",
    "description": "Mundo cripto",
    "content": "Este viernes, 29 de agosto de 2025, Ethereum inicia la jornada en España con una cotización de 5.087,47 euros. El valor de apertura refleja una variación del -192,69238 % en comparación con el cierre anterior, en una nueva muestra de la volatilidad que caracteriza a los activos digitales.\nEl precio del Ethereum y el euro ha mostrado una tendencia positiva en los últimos días. Esto indica que ambos activos están en un proceso de crecimiento sostenido.\nEn la última semana, la cotización de la criptomoneda Ethereum ha experimentado una caída del -9.26%, lo que refleja una tendencia a la baja en el corto plazo. Sin embargo, al analizar su rendimiento en el último año, se observa una variación positiva del 41.35%, indicando que, a pesar de las fluctuaciones recientes, Ethereum ha mostrado un crecimiento significativo en su valor a lo largo del tiempo. Esta combinación de resultados sugiere que, aunque enfrenta desafíos temporales, su rentabilidad a largo plazo sigue siendo prometedora.\nEn la última semana, la cotización de la criptomoneda Ethereum ha experimentado una caída del -9.26%, lo que refleja una tendencia a la baja en el corto plazo. Sin embargo, al analizar su rendimiento en el último año, se observa una variación positiva del 41.35%, indicando que, a pesar de las fluctuaciones recientes, Ethereum ha mostrado un crecimiento significativo en su valor a lo largo del tiempo. Esta combinación de resultados sugiere que, aunque enfrenta desafíos temporales, su rentabilidad a largo plazo sigue siendo prometedora.\nLa volatilidad económica de la última semana de Ethereum, con un 67.69%, es mayor que la volatilidad anual del 62.71%, lo que indica que su comportamiento es inestable y presenta muchas variaciones.\nLa volatilidad económica de la última semana de Ethereum, con un 67.69%, es mayor que la volatilidad anual del 62.71%, lo que indica que su comportamiento es inestable y presenta muchas variaciones.\nDurante los últimos 12 meses, elEthereumha llegado a costar en elmercado españolen un máximo de 5.610,7 euros mientras que su nivel más bajo ha sido 1.607,4 euros.",
    "url": "https://www.cronista.com/espana/criptomonedas-es/ethereum-a-cuanto-cotiza-este-viernes-29-de-agosto/",
    "source": "El Cronista",
    "published_at": "Actualizado el   29 de Agosto de 202515:14",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "e87faa4d7cda771a53d37d8f6f470fa3",
    "title": "Stablecoins y Fintech en América Latina: de la promesa a la infraestructura estratégica",
    "description": "Opinión",
    "content": "La narrativa global sobre tecnología financiera en 2024 estuvo marcada por una paradoja: mientras lainversión en fintechcayó en la mayoría de los mercados, América Latina experimentó un crecimiento del 86% en la captación de capital. En paralelo, el universo de lasstablecoins,criptomonedasdiseñadas para mantener un valor estable, mayormente anclado al dólar, vivió un momento decisivo, con un mercado que superó los USD 210.000 millones y transacciones por USD 26,1 billones. Entender cómo se conectan estas dos tendencias es clave para anticipar la próxima fase de innovación financiera en la región.\nEl auge de lasfintech latinoamericanasen 2024 se explica, en parte, por la madurez de un grupo selecto de jugadores que han logrado escalar con modelos rentables y sostenibles. Casos comoNubank,UaláoMercado Pagodemuestran que es posible combinar crecimiento acelerado con márgenes saludables, diversificación de productos y expansión geográfica. En todos ellos hay undenominador común: una visión estratégica clara, un control riguroso de costos y la capacidad de responder a las necesidades de un mercado históricamente subatendido.\nEse mismo espíritu pragmático es el que está impulsando la adopción de stablecoins más allá delmundo cripto. Hasta hace poco, su uso real se limitaba a arbitrajes y trading en plataformas descentralizadas. Hoy, un 8% de las transacciones ya se destina a pagos y liquidación de activos del mundo real.\nLa irrupción de redes como el Circle Payments Network, que integra bancos globales y aspira a competir directamente con SWIFT, o estándares como x402 de Coinbase para habilitarpagos automatizadosentre agentes deinteligencia artificial, muestra que hablamos de infraestructura en construcción, no de meros experimentos.\nEn América Latina, las stablecoins tienen un terreno fértil. La región combina una alta penetración móvil, grandes poblaciones no bancarizadas y, en varios países, monedas locales sometidas avolatilidad e inflación. Esto explica por qué en corredores como Estados Unidos y México ya representan cerca del 10% de las remesas, o por qué en mercados como Turquía y Nigeria, con realidades cambiarias similares, los usuarios las mantienen on-chain para evitar costos de conversión y preservar valor. Argentina, con su contexto macroeconómico, es un candidato natural para ver casos de adopción acelerada, tanto en pagos como en tesorería corporativa.\nNo obstante, el potencial viene acompañado deretos estructurales. El valor incremental que ofrecen las stablecoins frente a las redes de pagos tradicionales sigue siendo limitado en el corto plazo. Si bien pueden lograr liquidaciones casi instantáneas y costos marginales en blockchain, las fricciones aparecen en la \"última milla\": rampas de entrada y salida con comisiones de hasta 7%, liquidez local insuficiente en ciertos mercados y un marco regulatorio todavía fragmentado. La trazabilidad inherente a latecnología blockchainofrece ventajas en transparencia, pero también carece de la metadata y las protecciones al consumidor de las redes bancarias consolidadas.\nEn el plano regulatorio, 2025 marca un punto de inflexión. En Estados Unidos, la administración Trump ha impulsado un giro que prioriza la claridad normativa sobre stablecoins, frenando el desarrollo de undólar digitaly estableciendo reglas precisas sobre reservas y supervisión. Europa avanza con la plena implementación de MiCA, y países como Brasil, referente global con su sistema PIX, podrían liderar un modelo híbrido donde las monedas estables coexistan con depósitos tokenizados ymonedas digitales de bancos centrales.\nEn este contexto, las stablecoins no deberían verse como una amenaza a la banca tradicional, sino como un catalizador de modernización.Bancosy procesadores de pago tienen la oportunidad de integrarlas en sus servicios, desde cuentas y tarjetas hasta soluciones de tesorería y comercio internacional, generando eficiencia y ampliando su propuesta de valor.\nEl futuro del dinero en la región no se definirá por la supremacía de un único formato, sino por la capacidad de orquestarun ecosistema donde monedas estables, depósitos tokenizados y monedas digitales de bancos centrales convivan y se complementen.",
    "url": "https://www.cronista.com/columnistas/stablecoins-y-fintech-en-america-latina-de-la-promesa-a-la-infraestructura-estrategica/",
    "source": "El Cronista",
    "published_at": "Actualizado el   14 de Agosto de 202518:19",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "a44cd72bc6f4412163a1fa71f0ddd7f3",
    "title": "¿El dólar blue se mantiene a la baja? Las cuevas virtuales ya anticipan un nuevo precio",
    "description": "Mercado de cambios",
    "content": "Eldólar blueencontró cierta calma en las primeras dos semanas de agosto. El tipo de cambio paralelo, que había registradoun salto de $ 120 en julio,perdió $ 15 en lo que va del mes, cotizando a$ 1300 para la compray$ 1320 para la venta.\nPor su parte, losexchanges criptoy lascuevas virtualesnegociancotizacionesque hoy se encuentran muy por encima del billete informal.\nJustamente, lasplataformas digitalesactualizan en todo momento los valores de lasstablecoins, conocidas en Argentina como \"dólar cripto\". Soncriptomonedasespecialmente diseñadas para minimizar la volatilidad mediante la vinculación con un activo más fuerte; sean metales preciosos, recursos naturales odinero fiat (dólar, euro, etc.).\nIncluso,en época de elecciones o cuando el mercado no opera, los movimientos de estas monedas (USDT,DAIoUSDC) suelen anticipar lo que podría suceder con elprecio del blue.\nEl dólar criptoUSDT (Tether)se encuentra este domingo 17 de agosto -cerca de las 12 horas- a$ 1329,83en el popular exchangeBinance. Por ende, se mantiene levemente por encima de la actual cotización del tipo de cambio informal.\nOtras plataformas, además,negocian precios que oscilanentre $ 1328 y $ 1369.De igual modo, mantienen cierta diferencia respecto al precio del blue.\n\n\n\n\nEn Argentina, las monedas digitales más negociadas son las quesiguen el precio del dólar (relación 1 a 1), siendo una gran alternativa para quienes pretendendolarizar sus ahorros.\nUSDT (Tether)es el activo más solicitado por los inversores. Incluso, ostenta un mayor nivel de comercialización queBitcoinyEthereum.\n\n\n\n\n\n\n\n\nA su vez, también se transformó en la primera moneda en presentar el concepto de unastablecoin atada al dólar.Se puedeconseguir sin restricciones y durante las 24 horas del día.\nPor otro lado, los analistas sostienen quela cotización del USDT refleja la demanda real y la confianza en eldólarcomo una moneda más estable y fiable.",
    "url": "https://www.cronista.com/infotechnology/finanzas-digitales/el-dolar-blue-se-mantiene-a-la-baja-las-cuevas-virtuales-ya-anticipan-un-nuevo-precio/",
    "source": "El Cronista",
    "published_at": "Actualizado el   17 de Agosto de 202512:00",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "8c62701ad5226c3601a29d8c12c09d29",
    "title": "Bajó el dólar y las cuevas virtuales marcan un nuevo precio para la divisa",
    "description": "Cotizaciones",
    "content": "\n\n\nElprecio deldólar oficialbajó fuerte esta semana. Así, la moneda estadounidense cotiza a$ 1310para la venta y$ 1270para la compra en el Banco Nación. Por su parte, eldólar bluese negocia a$ 1320para la venta y de$ 1300para la compra.\nEn tanto, las cuevas virtuales y exchanges cripto operan preciosque hoy se encuentran ligeramente por encima. En las plataformas digitales en línea se negocia la compraventa destablecoins, también conocidas comodólar cripto, y que muchas personas ven como una versión digital del tradicionaldólar blue. No obstante, su precio actual suele ubicarse en un intermedio entre el informal, el MEP y el oficial.\nActualmente, las stablecoins que más se usan en la Argentina son las quesiguen el valor del dólar en una relación 1 a 1, como USDT o DAI. Gracias a esto, representan una opción digital de fácil adopción para dolarizar los ahorros.\nMuchos ahorristas consideran que lascotizaciones de lasstablecoinsson untermómetro clavea seguir, dado que anticipa los movimientos futuros del tipo de cambio, sobre todo deldólar blue, en el país. A continuación, los detalles.\n\nEldólar cripto USDTcotiza este sábado a$ 1327,6en el popular exchange Binance.\nAsí, el precio del dólar cripto se ubica por encima deldólar blue($ 1320), al igual que deldólaroficial ($ 1310) y del MEP ($1298,2).\nLos valores varían entre distintos exchanges o cuevas virtuales y, según señala CriptoYa, las cotizaciones pueden estar entre los$ 1325y los$ 1328.\nUSDT (Tether)es, en la actualidad, la stablecoin más aceptada del mercado cripto, además de ser la que goza de unmayor nivel de comercializaciónentre los ahorristas en la Argentina. De hecho, su volumen se encuentra incluso por encima de Bitcoin y Ethereum.\nSe puede comprar el \"dólar cripto\" USDTen cualquier cantidad y momento del día, además de que mantiene una relación 1:1 con el dólar. Por eso, son varios los analistas que consideran que su cotización refleja la demanda real y la confianza enel dólarcomo una moneda más estable y fiable en comparación con el peso argentino.\nHay que tener en cuenta que, en ocasiones como elecciones y otros eventos significativos que ocurrieron cuando el mercado del dólar blue está cerrado, los movimientos de stablecoins comoUSDTyDAIanticiparon lo que ocurriría con la cotización deldólar blue.",
    "url": "https://www.cronista.com/finanzas-digitales/bajo-el-dolar-y-las-cuevas-virtuales-marcan-un-nuevo-precio-para-la-divisa/",
    "source": "El Cronista",
    "published_at": "Actualizado el   16 de Agosto de 202509:58",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "947e099e73ab10dafc7d092cc315aa67",
    "title": "Argentina, líder cripto: recibe casi el 50% de los pagos globales en stablecoins",
    "description": "Nuevo récord",
    "content": "Argentina se consolida como líder mundialen la adopción de criptomonedaspara cancelar de salarios y honorarios profesionales.Casi el 50% de los pagos globales realizados por empresas tiene como destino las cuentas de los trabajadores argentinos.\n\nEste nivel de concentración refleja la demanda internacional de talento local en sectores como tecnología, desarrollo de software, marketing, diseño y Web3 así como la capacidad del ecosistema argentino para manejar pagos internacionales de manera eficiente y segura. Así lo refleja un relevamiento hecho por Bitwage, una de las plataformas pioneras en pagos con criptos.\n\nEl salario promedio en Argentina pagado mediantecriptomonedassupera los u$s 1600, un 25% más que la media global, y el 75% de los profesionales prefiere cobrar en stablecoins, como USDT o USDC, frente a un promedio global del 45%.\nEste comportamiento demuestra que la elección de criptoactivos no depende exclusivamente dela histórica brecha cambiaria, sino de una combinación de madurez del mercado, conciencia financiera y cultura de autonomía sobre los ingresos.\n\nComo señalaFabiano Dias, international business developer de Bitwage: \"Hoy lo que importa ya no es solo ganarle al dólar, sino tener libertad financiera, privacidad y acceso inmediato a activos digitales estables\".\n\nLatinoamérica representa el 60% de los pagos procesados por la plataforma, y dentro de ese universo,Argentina concentra el 73%, lo que la consolida como epicentro regional de la cripto-nómina,seguida por Brasil (9%), Colombia, Bolivia y Venezuela.\nLa adopción local no se limita al volumen: \"Los argentinos manejan wallets descentralizadas y stablecoins como instrumentos cotidianos de ahorro y pago, una diferencia significativa respecto a otros mercados que aún perciben las criptomonedas con cautela o desconocimiento\".\n\n\nEl crecimiento de la cripto-nómina no es exclusivo de Argentina. Según DataIntelo, el mercado global de pagos salariales en criptomonedas superó los u$s 1480 millones en 2024, con una tasa de crecimiento anual estimada del 19%.\nAunque en muchos países aún genera dudas o es utilizado de forma marginal, en otros, como Argentina, se integró de manera estructural a la vida financiera/cotidiana, incluso sin incentivos cambiarios.\n\nCon un marco legal que aún presenta zonas grises y una economía digital que avanza más rápido que las regulaciones,el uso de criptomonedas para cobrar sueldos parece haber dejado de ser una solución de emergenciapara transformarse en una decisión consciente, estratégica y cultural.\n\n\"Es impresionante cómo en Argentina el uso de stablecoins está completamente naturalizado, mucho más que en otros países de la región e incluso del mundo, donde todavía generan desconfianza o hasta incluso, hay desconocimiento de su existencia. Acá son parte de lo cotidiano. Muchos usuarios ya piensan directamente en USDT o USDC como una forma de ahorro o pago frecuente\", afirmó al respectoMaría Fernanda Juppet, CEO de CryptoMKT.\n\n\nEn declaraciones aEl Cronista, Dias explicó que, \"a medida que las monedas estables avanzan y se vuelven más fáciles de usar para compras en tiendas y puntos de venta,se convierte en una ventaja competitiva para una empresa pagar a sus empleados en dólares, ya sea total o parcialmente, en una moneda más segura que las de los países de Latinoamérica\".\n\nPor estas razones, el experto considera quela tendencia debería expandirse más allá de las empresas tecnológicas, especialmente las de Internet, hacia todos los sectores de la economía. Y no solo limitarse a las stablecoins, sino abarcar todo tipo de activos digitales que representen materias primas, productos financieros y acciones, e incluso a la propia empresa en formato digital o criptográfico, lo que hoy se conoce como RWA (Real World Assets o Activos del Mundo Real).\n\n¿Por qué los argentinos prefieren las criptomonedas incluso cuando ya no se trata solo de \"ganarle al dólar oficial\"? Desde Bitwage destacan un fenómeno cultural de fondo:la alta conciencia sobre la importancia de la libertad financiera y el valor de la privacidaden un país marcado por décadas de controles cambiarios, inflación e incertidumbre.\n\n\nEn este sentido, el acceso a \"wallets\" descentralizadas, sin procesos de identificación obligatorios (KYC), y el cobro directo en cripto representan una forma silenciosa pero potente de afirmar autonomía.No se trata solo de cómo cobrar, sino de cómo vivir y proteger los propios ingresos.\n\n\nEl caso argentino se inserta en un contexto global de crecimiento sostenido de la cripto-nómina. En paralelo,la adopción institucional de criptoactivos muestra un avance acelerado.\nSolo en julio, compañías que cotizan en bolsa compraron 49.000 BTC, por un total de u$s 5.800 millones, un balance de 955.000 Bitcoins, un crecimiento del 5% en un solo mes.\n\nEthereum y altcoins como SUI también comienzan a formar parte de las reservas corporativas, en lo que se denomina Crypto Treasuries. Por ejemplo: SharpLink Gaming adquirió 438.190 ETH, BitMine Immersion Technologies posee 600.000 ETH y Bit Digital convirtió u$s 172 millones en 100.603 ETH. Este movimiento evidencia la diversificación y maduración de las tesorerías corporativas hacia activos digitales.\n\nEstos datos fueron aportados a este medio por Matias Dajcz, CRO de Ripio, quien agregó, el sector DeFi también se encuentra en recuperación, con el Total Value Locked (TVL) al alcanzar cerca de u$s 178.000 millones, su nivel más alto en tres años.\nPlataformas como World Liberty Financial emite stablecoins y participa activamente en protocolos como AAVE y Ethereum, mientras Ripio Business consolida su posición en América Latina al ofrecer infraestructura segura y regulada para pagos y reservas en cripto. \"Más de 2.000 empresas de distintos sectores utilizan actualmente estos servicios, incluyendo casos de éxito como Mercado Pago (Brasil, México y Chile), IOL (Argentina) y OCA Blue (Uruguay)\", agregó Dajcz.",
    "url": "https://www.cronista.com/finanzas-mercados/argentina-recibe-casi-el-50-de-los-pagos-de-empresas-globales-en-criptomonedas/",
    "source": "El Cronista",
    "published_at": "Actualizado el   18 de Agosto de 202510:00",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "0334ef69993c13de6118991c922aafce",
    "title": "Baja el dólar y las cuevas virtuales ya anticipan un nuevo precio para la divisa",
    "description": "Cotizaciones",
    "content": "\n\n\nElprecio deldólar oficialbaja $ 15 este jueves 14 agosto, bajo la expectante mirada del mercado. Así, la moneda estadounidense cotiza a$ 1.310para la venta y $ 1.270 para la compra en el Banco Nación. Por su parte, eldólar bluebaja $ 20 y se negocia a $ 1.320 para la venta y de $ 1.300 para la compra.\nEn tanto, las cuevas virtuales y exchanges cripto operan preciosque hoy se encuentran ligeramente por debajo. En las plataformas digitales en línea se negocia la compraventa destablecoins, también conocidas comodólar cripto, y que muchos ven como una versión digital del tradicionaldólar blue. No obstante, su precio actual suele ubicarse en un intermedio entre el informal, el MEP y el oficial.\nLo cierto es que las stablecoins que más se usan en la Argentina son las quesiguen el valor del dólar en una relación 1 a 1, como USDT o DAI. Gracias a esto, representan una opción digital de fácil adopción para dolarizar los ahorros.\nMuchos ahorristas consideran que lascotizaciones de lasstablecoinsson untermómetro clavea seguir, dado que anticipa los movimientos futuros del tipo de cambio, sobre todo deldólar blue, en el país. A continuación, los detalles.\nEldólar cripto USDTcotiza este jueves a$ 1.315,9en el popular exchange Binance, alrededor de las 16.55 hs.\nAsí, el precio del dólar cripto se ubica por debajo deldólar blue($ 1.320), pero supera aldólaroficial ($ 1.310) y al MEP ($1.307).\nLos valores varían entre distintos exchanges o cuevas virtuales y, según señala CriptoYa, las cotizaciones pueden estar entre los$ 1.315y los$ 1.340.\nUSDT (Tether)es, en la actualidad, la stablecoin más aceptada del mercado cripto, además de ser la que goza de unmayor nivel de comercializaciónentre los ahorristas en la Argentina. De hecho, su volumen se encuentra incluso por encima de Bitcoin y Ethereum.\nSe puede comprar el \"dólar cripto\" USDTen cualquier cantidad y momento del día, además de que mantiene una relación 1:1 con el dólar. Por eso, son varios los analistas que consideran que su cotización refleja la demanda real y la confianza enel dólarcomo una moneda más estable y fiable en comparación con el peso argentino.\nHay que tener en cuenta que, en ocasiones como elecciones y otros eventos significativos que ocurrieron cuando el mercado del dólar blue está cerrado, los movimientos de stablecoins comoUSDTyDAIanticiparon lo que ocurriría con la cotización deldólar blue.",
    "url": "https://www.cronista.com/infotechnology/finanzas-digitales/baja-el-dolar-y-las-cuevas-virtuales-ya-anticipan-un-nuevo-precio-para-la-divisa/",
    "source": "El Cronista",
    "published_at": "Actualizado el   14 de Agosto de 202516:58",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "bfb9483f601bb28cbc6562ddc9d2be1c",
    "title": "Sube el dólar y las cuevas virtuales ya anticipan un nuevo precio para la divisa",
    "description": "Cotizaciones",
    "content": "\n\nElprecio deldólar oficialbaja este miércoles 13 agosto, bajo la inquieta mirada del mercado. Así, la moneda estadounidense cotiza a$ 1.325para la venta y $ 1.285 para la compra en el Banco Nación. Por su parte, eldólar bluesube $ 10 y se negocia a $ 1.340 para la venta y de $ 1.320 para la compra.\nEn tanto, las cuevas virtuales y exchanges cripto operan preciosque hoy se encuentran ligeramente por debajo. En las plataformas digitales en línea se negocia la compraventa destablecoins, también conocidas comodólar cripto, y que muchos ven como una versión digital del tradicionaldólar blue. No obstante, su precio actual suele ubicarse en un intermedio entre el informal, el MEP y el oficial.\nDe hecho, las stablecoins que más se usan en la Argentina son las quesiguen el valor del dólar en una relación 1 a 1, como USDT o DAI. Gracias a esto, representan una opción digital de fácil adopción para dolarizar los ahorros.\nMuchos ahorristas creen que lascotizaciones de lasstablecoinsson untermómetro clavea seguir, dado que anticipa los movimientos futuros del tipo de cambio, sobre todo deldólar blue, en el país. A continuación, los detalles.\nEldólar cripto USDTcotiza este miércoles a$ 1.324,3en el popular exchange Binance, alrededor de las 11.50 hs.\nAsí, el precio del dólar cripto se ubica por debajo deldólar blue($ 1.340) deldólaroficial ($ 1.325), aunque supera ligeramente al MEP ($1.318).\nLos valores varían entre distintos exchanges o cuevas virtuales y, según señala CriptoYa, las cotizaciones pueden estar entre los$ 1.324y los$ 1.355.\nUSDT (Tether)es, hoy en día, la stablecoin más aceptada del mercado cripto, además de ser la que goza de unmayor nivel de comercializaciónentre los ahorristas en la Argentina. De hecho, su volumen se encuentra incluso por encima de Bitcoin y Ethereum.\nEs posible comprar el \"dólar cripto\" USDTen cualquier cantidad y momento del día, además de que mantiene una relación 1:1 con el dólar. Por eso, son varios los analistas que consideran que su cotización refleja la demanda real y la confianza enel dólarcomo una moneda más estable y fiable en comparación con el peso argentino.\nSe debe tener en cuenta que, en ocasiones como elecciones y otros eventos significativos que ocurrieron cuando el mercado del dólar blue está cerrado, los movimientos de stablecoins comoUSDTyDAIanticiparon lo que ocurriría con la cotización deldólar blue.",
    "url": "https://www.cronista.com/infotechnology/finanzas-digitales/sube-el-dolar-y-las-cuevas-virtuales-ya-anticipan-un-nuevo-precio-para-la-divisa/",
    "source": "El Cronista",
    "published_at": "Actualizado el   13 de Agosto de 202514:48",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "0fbbd0d87291b71381079f1e3989f549",
    "title": "Ethereum coquetea con sus máximos históricos: por qué es el motor de la euforia cripto",
    "description": "Altcoins",
    "content": "Ethereumvolvió al centro de la escena del mercado cripto. Este miércoles, el token se mantiene por encima delos u$s 4700 y se encuentra a solo 3% de su máximo histórico de u$s 4878,26, con un aumento del6,1% en las últimas 24 horas.\nEste repunte no solo refleja un impulso alcista a corto plazo, sino también un interés creciente de inversores que buscan diversificación más allá de Bitcoin.\n\nEl movimiento se dio con un volumen de u$s 60.158 millones en una sola jornada, lo que indica participación activa del mercado y liquidez suficiente para sostener la suba.\nAdemás, Ethereum cotiza cerca de su máximo diario,lo que expone que la fuerza compradora domina el mercado y no se trata de un rebote técnico aislado. La capitalización de mercado de ETH alcanza losu$s 563.926 millones, y consolida su posición como la segunda criptomoneda más importante del mercado.\n\nUno de los factores que refuerza la narrativa de Ethereum es la rotación de capital desde Bitcoin. La dominancia de BTC cayó del 65% al 59% en los últimos dos meses, mientras que Bitcoin se mantiene en u$s 120.000 tras rebotar desde los u$s 112.000. Este escenario sugiere que parte de los inversores trasladó ganancias de Bitcoin hacia altcoins, lo que impulsó la suba de ETH y otras monedas de menor capitalización.\n\n\nLa combinación de un fuerte volumen, precios cerca de máximos diarios y una rotación de capital hacia altcoinsconfirma que Ethereum lidera la recuperación del mercado. Para inversores estratégicos, esta fase ofrece oportunidades de exposición a un activo con un presente sólido, respaldado por liquidez real y un interés creciente que podría sostener nuevos niveles de precio en el corto y mediano plazo.\n\nDesdeBuenbitsostienen que lo que sucede con Ethereum no es solo momentum: \"Hay demanda estructural vía vehículos regulados y, al mismo tiempo, menos ETH disponible para la venta. Esa combinación comprime la oferta y acelera los movimientos\", explicaron desde el Equipo de Research.\n\nSegún indican, en julio los productos institucionales de cripto registraron su máxima semana histórica de entradas (u$s 4,39 mil millones). \"Ethereum se robó el show' con u$s 2.12 mil millones en solo siete días. Estas participaciones se crean con la compra ETH al contado, lo que agrega presión compradora directa\".\n\nBuenbit Research aseguró: \"Cuando hay entradas netas en los ETF, los participantes autorizados compran ETH para crear nuevas cuotas del fondo. Con menos oferta suelta, la transmisión a precio se vuelve más rápida\".\n\nAl respecto,Pablo Monti,Brand Manager y Portavoz de BingX, señaló en declaraciones aEl Cronistaque la suba de la segunda mayor cripto por marketcap encuentra sustento en gran medida, por un aumento notable en el volumen de operaciones, un flujo institucional creciente de stablecoins y \"un contexto macroeconómico favorable\".\n\nMonti es claro: \"El movimiento no solo indica que ETH recupera terreno frente a BTC, sino que también podría preparar el terreno para registrar un nuevo máximo histórico\".Y es que diversos analistas identifican la zona de los u$s 4750 como resistencia clave antes de ir en busca de ese objetivo.\n\nPara el experto, la adopción institucional, el auge de DeFi y los avances en soluciones de capa 2 impulsan las expectativas de que ETH alcance un nuevo máximo histórico. \"Con un mercado favorable, la solidez de su red y el creciente número de desarrolladores refuerzan su papel como plataforma líder, y amplian su base de usuarios y su ventaja frente a competidores\", concluyó.\n\nDesde la perspectiva de capitalización, Ethereum mantiene con holgura el puesto como la segunda criptomoneda más relevante, con u$s 563.926 millones. El suministro circulante alcanza los u$s 120,7 millones de ETH, lo que coincide con la cantidad total emitida, lo que significa que no hay ETH adicional bloqueado que pueda alterar la dinámica de oferta inmediata, según datos de Sosovalue.\n\nSi el impulso alcista continúa, el próximo objetivo técnico para ETH se sitúa en la zona de u$s 4800-4900, mientras que soportes inmediatos se ubican en u$s 4500-4550.Los expertos señalan que, históricamente, movimientos diarios superiores al 5% en altcoins líderes suelen coincidir con rotaciones de capital hacia estos activos, un patrón que Ethereum parece repetir por estas horas.\nEn paralelo, Bitcoin muestra un avance más moderado, lo que enfatiza que los inversores viran su atención a oportunidades de crecimiento en la segunda mayor criptomoneda del mercado.\nDesde Lemon, señalaron que  el rally alcista de Ethereumdespertó el interés del mercado minorista en Argentina. \"Julio de 2025 fue el mes con mayor volumen operado de ETH en la historia de Lemon, con un 57% destinado a compras\", aseguraron.\nSegún el exchange de la City, en lo que va de agosto, la tendencia continúa: \"Ayer, el 12 de agosto, se alcanzó récord histórico diario de volumen operado de Ethereum, con un 62% correspondiente a compras\".",
    "url": "https://www.cronista.com/finanzas-mercados/ethereum-cerca-de-sus-maximos-historicos-por-que-es-el-motor-de-la-euforia-cripto/",
    "source": "El Cronista",
    "published_at": "Actualizado el   13 de Agosto de 202517:10",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "774b4ce80a9b9dfbf4999e4fd5891fb8",
    "title": "Inquietud por el dólar: cuál es el nuevo precio que hoy anticipan en cuevas virtuales",
    "description": "Cotizaciones",
    "content": "\n\nElprecio deldólar oficialbaja $ 5 este martes 12 agosto, bajo la expectante mirada del mercado, luego de haber acumulado una baja de $ 40 la semana pasada. Así, la moneda estadounidense cotiza a$ 1.330para la venta y $ 1.290 para la compra en el Banco Nación. Por su parte, eldólar blueretrocede $ 5 y se negocia a $ 1.330 para la venta y de $ 1.310 para la compra.\nEn tanto, las cuevas virtuales y exchanges cripto operan preciosque hoy se encuentran ligeramente por debajo. En las plataformas digitales en línea se negocia la compraventa destablecoins, también conocidas comodólar cripto, y que muchos ven como una versión digital del tradicionaldólar blue. No obstante, su precio actual suele ubicarse en un intermedio entre el informal, el MEP y el oficial.\nLas stablecoins que más se usan en la Argentina son las quesiguen el valor del dólar en una relación 1 a 1, como USDT o DAI. Gracias a esto, representan una opción digital de fácil adopción para dolarizar los ahorros.\nMuchos ahorristas consideran que lascotizaciones de lasstablecoinsson untermómetro clavea seguir, dado que anticipa los movimientos futuros del tipo de cambio, sobre todo deldólar blue, en el país. A continuación, los detalles.\nEldólar cripto USDTcotiza este martes a$ 1.331en el popular exchange Binance, alrededor de las 18.35 hs.\nAsí, el precio del dólar cripto se ubica por encima deldólar bluey eldólaroficial (ambos a $ 1.330), y también supera al valor del MEP ($1.323).\nLos valores varían entre distintos exchanges o cuevas virtuales y, según señala CriptoYa, las cotizaciones pueden estar entre los$ 1.331y los$ 1.355.\nUSDT (Tether)es, en la actualidad, la stablecoin más aceptada del mercado cripto, además de ser la que goza de unmayor nivel de comercializaciónentre los ahorristas en la Argentina. De hecho, su volumen se encuentra incluso por encima de Bitcoin y Ethereum.\nSe puede comprar el \"dólar cripto\" USDTen cualquier cantidad y momento del día, además de que mantiene una relación 1:1 con el dólar. Por eso, son varios los analistas que consideran que su cotización refleja la demanda real y la confianza enel dólarcomo una moneda más estable y fiable en comparación con el peso argentino.\nHay que tener en cuenta que, en ocasiones como elecciones y otros eventos significativos que ocurrieron cuando el mercado del dólar blue está cerrado, los movimientos de stablecoins comoUSDTyDAIanticiparon lo que ocurriría con la cotización deldólar blue.",
    "url": "https://www.cronista.com/infotechnology/finanzas-digitales/inquietud-por-el-dolar-cual-es-el-nuevo-precio-que-hoy-anticipan-en-cuevas-virtuales/",
    "source": "El Cronista",
    "published_at": "Actualizado el   12 de Agosto de 202518:39",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAASwAAACpAQMAAACruZLpAAAAA1BMVEUAAACnej3aAAAAAXRSTlMAQObYZgAAAB1JREFUWIXtwTEBAAAAwqD1T20ND6AAAAAAAAA4Mhm/AAEAspRDAAAAAElFTkSuQmCC"
    }
  },
  {
    "id": "4f595fb7b48e9450d156a06141b8768f",
    "title": "Dos potencias militares se aliaron para controlar el Pacífico y tener una posición estratégica en la Tercera Guerra Mundial",
    "description": "Tensión",
    "content": "En medio de diferentesconflictos bélicosque atraviesan al mundo, losejércitos de China y Rusiahicieron una fuerte alianza para realizar una misión de patrullaje en elocéano Pacífico. El despliegue incluyósubmarinos de última generaciónde ataque de tipo diésel-eléctricos.\nLa \"cortina de hierro\" que Europa está construyendo para defenderse: teme que este país ataque y desate la Tercera Guerra Mundial\n¿Tercera Guerra Mundial? El Pentágono crea un escuadrón especial para proteger al país de drones asesinos\nLaFlota del Pacífico de Rusiay la Armada Naval de Chinarealizaron una inspección de forma conjunta que incluyó maniobras de navegación por elMar de Japón y el Mar de China Orientalcon submarinos de ataque.\nEn este sentido, se utilizó el poderoso submarino ruso Volkhov B-603, del Proyecto 636.3, de clase Kilo, el cualrecorrió más de 3.200 kilómetrosdesde su base en Vladivostok.\nDicho sumergible tienemisiles de crucero de ataque terrestre Kalibry torpedos de gran potencia y está preparado paramisiones de combatetanto en superficie como en el océano.\nLossubmarinos rusosy las unidades desplegadas por la Armada china operaron de manera coordinada con la corbeta rusa Gromkiy y el buqueantisubmarino Almirante Tributs. Además, brindaron servicios los destructores chinos Urumqi y Shaoxing, con buques auxiliares de apoyo.\nLa misión, por su parte,se planteó como un despliegue táctico y estratégicoen el Mar de Japón, lo que se conoce como una zona de una importante influencia militar por la presencia de naves estadounidenses en la región.\nEn ese sentido, la Agencia de Noticias de Rusia TASS, explicaron que el objetivo del patrullaje con los submarinos\"es fortalecer la cooperación naval entre los dos países, garantizar la paz y la estabilidad en la región Asia-Pacífico, monitorear el área yproteger las instalaciones económicas marítimas rusas y chinas\", subrayaron.\nEn tanto, la misión forma parte de un trabajo conjunto entre ambos ejércitos y quecomenzó a desplegarse en el año 2021, la cual tuvo 10 buques de guerra de la armada de Rusia y China, respectivamente.\nEn 2023 se puso en marcha unaalianza entre los ejércitos de China y Rusiapara hacer controles y patrullajes aéreos en diferentes regiones del Pacífico. Recientemente, un pelotón debombarderos estratégicos T-95MSde lasFuerzas Aeroespaciales rusasefectuaron una misión de patrullaje sobre aguas neutrales del mar de Japón.\nRespecto de las misiones conjuntas de los ejércitos, se llevó adelante el patrullaje Joint Sea-2025,las fuerzas de China y Rusia sobrevolaron la zona cercana de Vladivostok, lo cual se sumó a la Flota del Pacífico rusa.",
    "url": "https://www.cronista.com/informacion-gral/dos-potencias-militares-se-aliaron-para-controlar-el-pacifico-y-tener-una-posicion-estrategica-en-la-tercera-guerra-mundial/",
    "source": "El Cronista",
    "published_at": "Actualizado el   29 de Agosto de 202520:05",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": null
    }
  },
  {
    "id": "3d23ee1c7786d04ade0712f1e1dbfb58",
    "title": "Descubrimiento del siglo: cambia la historia de la humanidad tras el hallazgo de la fuente del agua de la vida",
    "description": "Arqueología",
    "content": "Unhallazgo arqueológico extraordinarioen pleno corazón de Montevideo -Uruguay- está revolucionando nuestra comprensión de la vida colonial en el Río de la Plata.\nLo que en un principio comenzó como una simple instalación de un ascensor en elMuseo Histórico Cabildo de Montevideose convirtió en uno de los descubrimientos más importantes de la región.\nLosrestos encontradosno solo nos hablan del pasado:revelan cómo era realmente la vida de los primeros pobladores de Uruguayy por qué el agua era tan preciada en esa época.\nDurante las obras de instalación de un ascensor para mejorar la accesibilidad del museo, los trabajadores se toparon con algo inesperado: estructuras arqueológicas coloniales perfectamente conservadas bajo tierra.\nLa arqueólogaNicol de León, quien está liderando la investigación, explicó que elhallazgoincluye \"un montón de estructuras de distintas épocas y también objetos de época colonial y de la primera etapa de la independencia\" de Uruguay.\nLos objetos desenterrados pintan un cuadro fascinante de la vida cotidiana:\nEl descubrimiento más intrigante es lo que los arqueólogos creen que podría seruna antigua fuente de agua colonial. Aunque los trabajos de excavación continúan, esta estructura tiene características que la hacen única.\nLahistoriadora Ana Ribeiro, viceministra de Educación y Cultura de Uruguay, explicó que \"el agua fue siempre un problema para Montevideo\" por una razón muy específica: \"Montevideo era una ciudad amurallada. En cualquier situación de guerra o sitio, la ciudad quedaba completamente aislada y dependía únicamente de sus fuentes internas de agua\".\nEl problema era que el agua no era abundante, lo que convertía cada fuente en un recurso estratégico vital para la supervivencia de la población.\nRibeiro también reveló un dato fascinante: no todas las aguas eran iguales.\"Las aguas del oeste tenían prestigio de ser las mejores\"y existía una verdadera \"leyenda urbana\" sobre ciertas fuentes.\nUna de las más famosas era la fuente abierta porLuis Mascareñas, uno de los primeros pobladores de Montevideo, de la cual se decía que teníapropiedades especiales para la salud.\n¿Será esta la fuente encontrada en el Cabildo? Los arqueólogos están trabajando para confirmarlo.\nSegún De León, los objetos y estructuras encontradas\"nos hablan de la vida, de cómo era la ciudad, Montevideo, desde la época colonial hasta 1800 y tanto\".\nHigiene y salubridad\nSistemas de abastecimiento de agua\nAlimentación y clases sociales\nEl descubrimiento pone en una situación compleja a las autoridades del museo. María Inés Obaldía, directora de Cultura de la Intendencia de Montevideo, explicó que el ascensor es necesario paragarantizar la accesibilidad al segundo pisodel museo.\nPero ahora deben decidir: ¿vale la pena sacrificar este tesoro arqueológico por la comodidad moderna?\n\nDe León confirmó que se elaborará un informe completo para que la Comisión Nacional de Patrimonio tome la decisión final sobre si el ascensor se podrá instalar o no en el patio donde se hizo el hallazgo.",
    "url": "https://www.cronista.com/internacionales/descubrimiento-del-siglo-cambia-la-historia-de-la-humanidad-tras-el-hallazgo-de-la-fuente-del-agua-de-la-vida/",
    "source": "El Cronista",
    "published_at": "Actualizado el   28 de Agosto de 202513:45",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": null
    }
  },
  {
    "id": "843cdefbb551e2fa26f2c3132d9b46f1",
    "title": "ARCA | El Gobierno suspenderá todas las cuentas bancarias y tarjetas de crédito de los contribuyentes de esta lista",
    "description": "Atención",
    "content": "La Agencia de Recaudación y Control Aduanero (ARCA) implementó una medida que puede afectar directamente a miles de argentinos:la suspensión de cuentas bancarias, tarjetas de crédito y billeteras virtualesde aquellos contribuyentes que figuren en la lista de \"no confiables\".\nEsta decisión se enmarca dentro de las políticas gubernamentales para combatir la evasión fiscal y lasoperaciones financieras irregulares.\nSegún laComunicación A 8144/2024emitida en conjunto con el Banco Central de la República Argentina (BCRA), los CUITs clasificados como \"no confiables\" quedarán bloqueados en todos sus medios de pago digitales y tradicionales.\nEsta medida no es menor: significa queno vas a poder usar ninguno de tus medios de pagohasta que regularices tu situación ante el organismo recaudador.\nLa suspensión es integral y abarca:\nEn pocas palabras:quedás completamente desconectado del sistema financierohasta resolver el problema con ARCA.\nARCA puede declararte \"no confiable\" por varios motivos. Los más comunes son:\nSi tenés un comercio, la situación es aún más complicada. Las empresas procesadoras de pagos (como Prisma, First Data, etc.)están obligadas a bloquear todas las operacionesque provengan de CUITs irregulares.\nEsto significa queno vas a poder cobrar:\nTu negocio quedará prácticamente paralizado hasta que soluciones el problema.\nPor suerte, ARCA habilitó un procedimiento online para regularizar la situación. Acá te explicamos paso a paso cómo hacerlo:\nUna vez que inicies el trámite, ARCA va a revisar tu caso y te van a notificar la resolución a través deldomicilio fiscal electrónicoque tengas registrado.\nPara no terminar en esta lista, es fundamental que:\nAunque ARCA no especifica plazos exactos,la experiencia indica que el proceso puede demorar entre 15 y 30 días hábiles, dependiendo de la complejidad del caso y la documentación presentada.\nDurante este tiempo,seguís sin poder usar ningún medio de pago, por lo que es fundamental actuar rápido si recibís una notificación.\nSi recibiste una comunicación deARCAo sospechás que podés estar en esta lista:\n\nLa nueva política de ARCA busca ordenar el sistema tributario, pero puede generar serios inconvenientes si no estás al día con tus obligaciones fiscales.La clave está en la prevención y en actuar rápidamentesi ya estás afectado por esta medida.",
    "url": "https://www.cronista.com/economia-politica/arca-el-gobierno-suspendera-todas-las-cuentas-bancarias-y-tarjetas-de-credito-de-los-contribuyentes-de-esta-lista-8115/",
    "source": "El Cronista",
    "published_at": "Actualizado el   28 de Agosto de 202516:50",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": null
    }
  },
  {
    "id": "57e9da5c1f84d1cfec8cf274b6643cee",
    "title": "Resultados de la quiniela de Provincia y Ciudad en la Vespertina: las cifras ganadoras del sábado 30 de agosto",
    "description": "En vivo",
    "content": "Así quedó el listado de ganadores de la Quiniela de Nacional en la vespertina de este sábado, 30 de agosto de 2025. A la cabeza salió el número 7123 (Cocinero) y las letras son:I G X Z.\nAsí quedó el listado de ganadores de la Quiniela de Provincia en la vespertina de este sábado 30 de agosto. A la cabeza salió el número0669 -Vicios.\nEn cuanto a los premios,la quiniela en Argentinano cuenta con pozo fijo,sino que los montos se fijan en base al número de aciertos de los apostadores.\nLas competencias efectúan los llamadostope de banca,fijado por cada departamentoy se usa para repartir los pagos toda vez que la estimación de premios a abonar pase ese tope determinado.\nSoñar con un cocinero puede simbolizar la creatividad y la capacidad de transformar ideas en realidades. Este sueño a menudo refleja el deseo de nutrir y cuidar de uno mismo y de los demás, así como la importancia de la preparación y la planificación en la vida.Además, un cocinero en sueños puede representar la necesidad de encontrar equilibrio en las relaciones personales. Puede indicar que es momento de mezclar diferentes aspectos de la vida para lograr armonía y satisfacción emocional.\nSoñar con un cocinero puede simbolizar la creatividad y la capacidad de transformar ideas en realidades. Este sueño a menudo refleja el deseo de nutrir y cuidar de uno mismo y de los demás, así como la importancia de la preparación y la planificación en la vida.\nAdemás, un cocinero en sueños puede representar la necesidad de encontrar equilibrio en las relaciones personales. Puede indicar que es momento de mezclar diferentes aspectos de la vida para lograr armonía y satisfacción emocional.\nSoñar con vicios puede reflejar una lucha interna con comportamientos o hábitos que consideras negativos en tu vida. Estos sueños a menudo simbolizan la necesidad de confrontar y superar aspectos de ti mismo que te están limitando o causando malestar.Además, los vicios en los sueños pueden indicar una advertencia sobre la indulgencia excesiva en ciertas áreas, sugiriendo que es momento de reevaluar tus elecciones y buscar un equilibrio más saludable en tu vida diaria.\nSoñar con vicios puede reflejar una lucha interna con comportamientos o hábitos que consideras negativos en tu vida. Estos sueños a menudo simbolizan la necesidad de confrontar y superar aspectos de ti mismo que te están limitando o causando malestar.\nAdemás, los vicios en los sueños pueden indicar una advertencia sobre la indulgencia excesiva en ciertas áreas, sugiriendo que es momento de reevaluar tus elecciones y buscar un equilibrio más saludable en tu vida diaria.",
    "url": "https://www.cronista.com/informacion-gral/resultados-de-la-quiniela-de-provincia-y-ciudad-en-la-vespertina-las-cifras-ganadoras-del-sabado-30-de-agosto/",
    "source": "El Cronista",
    "published_at": "Actualizado el   30 de Agosto de 202522:06",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": null
    }
  },
  {
    "id": "91e558c2d88240f34581434d6760b07b",
    "title": "Resultado de la quiniela de Córdoba en la Vespertina: las cifras ganadoras de este sábado 30 de agosto",
    "description": "En vivo",
    "content": "Este sábado, 30 de agosto de 2025, la agencia de loterías publicó los resultados del sorteo de la quiniela de Córdoba en la Vespertina. Estos son los números ganadores a la cabeza y a los premios:a la cabeza 4881(Las Flores).\nDesde el 14 de agosto de 2008, los premiados de premios que sobrepasen los $10 deberán pagar una reducción del 2%, de acuerdo con lo dispuesto por la Ley Provincial Nº 9505 y su Decreto Reglamentario.\nEse porcentaje es destinado al Programa de Asistencia Integral Córdoba (PAICOR), que brinda asistencia alimentaria a estudiantes de escuelas públicas en situación de vulnerabilidad.\nSoñar con flores suele simbolizar la belleza, la renovación y el crecimiento personal. Estas visiones pueden reflejar sentimientos de felicidad, amor y armonía en la vida del soñador. Las flores también pueden representar nuevas oportunidades y el florecimiento de relaciones.Además, el tipo de flores en el sueño puede tener significados específicos. Por ejemplo, las rosas pueden indicar amor romántico, mientras que las margaritas pueden simbolizar la inocencia. En general, soñar con flores invita a la reflexión sobre las emociones y las experiencias positivas que se están viviendo.",
    "url": "https://www.cronista.com/informacion-gral/resultado-de-la-quiniela-de-cordoba-en-la-vespertina-las-cifras-ganadoras-de-este-sabado-30-de-agosto/",
    "source": "El Cronista",
    "published_at": "Actualizado el   30 de Agosto de 202522:06",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": null
    }
  },
  {
    "id": "14e0b8a739eb0bb61e0a47037036862f",
    "title": "Quiniela de Tucumán en la Vespertina: estos son los resultados del sábado 30 de agosto",
    "description": "Lotería",
    "content": "Así quedó el listado de números ganadores de la Quiniela de la provincia de Tucumán en la vespertina de este sábado, 30 de agosto de 2025. A la cabeza salió el 7933 (Cristo).\nA pesar de que ganar en la Quiniela depende del azar, consultar los resultados anteriores y las estadísticas puede darte una ventaja estratégica al apostar.\nLa Redoblona se basa en apostar a dos números de dos cifras, cada uno con su propia ubicación de premio. Para ganar, ambos números deben salir dentro de las posiciones elegidas en el mismo sorteo. Es la modalidad que más paga por peso apostado.",
    "url": "https://www.cronista.com/informacion-gral/quiniela-de-tucuman-en-la-vespertina-estos-son-los-resultados-del-sabado-30-de-agosto/",
    "source": "El Cronista",
    "published_at": "Actualizado el   30 de Agosto de 202522:06",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": null
    }
  },
  {
    "id": "ec7b875ba31648e463f5eb6bdecd2e16",
    "title": "En qué recomienda invertir Spotorno para \"estar cubierto\" frente a la volatilidad del dólar",
    "description": "\"Super importante\"",
    "content": "Agosto finalizó con un repunte deldólar oficial, al cerrar a$ 1360 para la ventaen la última jornada del mes. La divisa acumuló un incremento de $ 25 en la semana, mientras laincertidumbre preelectoral y las tensiones políticassuman preocupación para lo que sucederá luego de las elecciones legislativas, especialmente en la provincia de Buenos Aires.\nEn este contexto, el economistaFausto Spotorno,Director del Centro de Estudios Económicos de OJF, enumeró los motivos detrás delmovimiento del tipo de cambio y adelantó escenarios de cómo responderá el mercado tras los comicios.\n\"El dólardepende mucho de la confianza de entrada de capitales. Si una economía genera mucha confianza y donde entran muchos capitales, el tipo de cambio va a tender a estar bajo. Y si una economía genera desconfianza y salen los capitales, el tipo de cambio va a tender a estar alto\", planteó en diálogo porRadio Rivadavia. \"Argentina todavía no ha mostrado entrada de capitales\", agregó.\nOtro punto que señalóSpotornofue la rápida caída de la entrada de dólares por parte de laliquidación del agro y las exportaciones. Y lo atribuyó a la baja temporal de las retenciones: \"Eso hizo que muchos agropecuarios adelantaran exportaciones.El dólar empieza a subir al mismo tiempo que se recomponen las retenciones\".\nEl tercer impacto, según su mirada, \"es estemomento político\". \"Si vos tenés un programa económico creíble, que puede funcionar a largo plazo,el mercado va a analizar qué tan probables es que ese programa económico siga o no funcionando. Y ahí es donde se juega la cuestión electoral\", explicó.\n\"Si pensamos queeste tema de los audios puede dañar las probabilidades de que el programa económico funcione bieny que se puedan hacer todas las cosas que todavía hay que hacer, entoncesahí empiezan las dudas y caen las bolsas, los bonos y sube el dólar.¿Por qué? Porquehay dudas de que este ruido político pueda llegar a perjudicar al Gobierno o generar cierto incendio en los mercados. Y eso es lo que estamos viendo en este momento\", advirtió.\nRespecto a qué puede pasar después de las elecciones, el especialista marcó dos escenarios:mejoras económicas si el gobierno logra buenos resultados o incertidumbre ante un revés del oficialismo.\n\"No es que la oposición tiene un programa alternativo, no es que hay otra cosa. Entonces,si ves estos dos escenarios, claramente que están todos muy preocupados. Y me parece que eso es lo que hoy estás viendo. Ponele que el impacto de todo este ruido político sea bajo en términos electorales, pero el problema es que el signo de pregunta puede ser cualquier cosa.El escenario malo es muy malo y ahí estamos parados\", aseveró.\nConsultado sobre cómo puede resguardarse la gente en un contexto devolatilidad cambiariae incertidumbre, Spotorno consideró que las estrategias dependerán del \"grado de audacia\" de los inversores.\nActo seguido, denominó a ladiversificación de las carterascomo una \"regla súper importante\" para maximizar la rentabilidad: \"No pongan los huevos en la misma canasta, siempre es una buena recomendación\".\n\n\"Si vos estás muy preocupado, comprar dólares y dormir tranquilo. Perono te pierdas las tasas, te están pagando las tasas fenomenales a corto plazo. Entonces,mi recomendación es diversifica: un poco enplazo fijo, un poco en dólar\", destacó.\nPara un perfil más agresivo, una alternativa que vio interesante son lasletras y los fondos comunes de inversión.\n\"Con un poco en tasas y un poco de dólar, deberías estar bastante cubierto de esa manera y aprovechar un poquito las otras tasas que te están ofreciendo\", completó.",
    "url": "https://www.cronista.com/finanzas-mercados/en-que-recomienda-invertir-spotorno-para-estar-cubierto-frente-a-la-volatilidad-del-dolar/",
    "source": "El Cronista",
    "published_at": "Actualizado el   30 de Agosto de 202519:30",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": null
    }
  },
  {
    "id": "cd2a3a7347cf488ee1fa7a20040e76c2",
    "title": "La respuesta del Gobierno a las versiones sobre el uso de dólares del FMI para contener la divisa",
    "description": "Tipo de cambio",
    "content": "Lapolítica cambiariay elrumbo intermitente del dólarson seguidos de cerca por los bancos, economistas y consultoras, en medio de la expectativa electoral y la reacción que pueda tener en el mercado luego de los comicios.\nEn ese escenario, el equipo económico defendió la estrategia oficial en medio de la volatilidad cambiaria y echó por tierra las versiones de que el  Gobierno utilicedólares delprograma firmado con el Fondo Monetario Internacional (FMI)en abril para intervenir en el mercado cambiario.\nAsí lo planteó hoyPablo Quirno, secretario de Finanzas y hombre de confianza del ministro Luis Caputo: \"No se ha usado ni un solo dólar del FMI del programa que comenzó en Abril\".\nTodo inició con un posteo del economista Christian Buteler en X, quien sugirió que elTesoro estaría vendiendo dólares dentro de la banda de flotación cambiaria. \"No sería la primera vez que Caputo utiliza los dólares del FMI para contener elprecio del dólar. Ese había sido el motivo por el cuál el organismo pidió su remoción cuando era Presidente del BCRA en el 2018\", recordó.\nEl funcionario contestó: \"Uno que no entiende que los dólares del FMI que tomó el Tesoro los tiene el BCRA producto de la recapitalización que se realizó con los desembolsos\".\n\nLa respuesta deQuirnoprovocó varios comentarios de los usuarios. Uno de ellos escribió: \"Como le piensan pagar a los organismo internacionales y luego a los bonistas? No van a descapitalizar al Central me imagino, pero el Tesoro no solo no compra verde sino q vende\". El secretario fue breve: \"Como hemos hecho desde el primer día de gobierno\".\nTambién rechazó acusaciones de \"alquimia contable\" y subrayó que \"los números están clarísimos, más que nunca\". \"La deuda que le generó el Tesoro al BCRA ha vuelto a ser responsabilidad del Tesoro\", le replicó a otro usuario.\nPese al torniquete del Banco Central a los bancos, las reservas brutas internacionales cayeron fuertemente este viernes, como suele suceder cada fin de mes.Las tenencias del BCRA retrocedieron casi u$s 1000 millones y cerraron la semana en u$s 39.966 millones.\n\n\nEn la jornada del jueves totalizaban u$s 40.961 millones, por lo que el desplome fue de u$s 995 millones.\nLa entidad conducida por Santiago Bausili había intensificado el apretón monetario, ya no sólocontrolando la liquidez en pesos de los bancos, sino también su posición en moneda extranjera, es decir, en dólares.\nEl cambio clave, que entró en vigor desde este viernes hoy, estableció quelas entidades no pueden aumentar su posición en dólares el último día hábil de cada mes.Por un movimiento habitual de cierre de posiciones de los bancos, que provoca una redistribución de fondos y mayor demanda de efectivo, al finalizar cada mes caen las reservas, retroceso que es revertido en los primeros días del mes siguiente.\n\nA su vez,el Central fijó un 30% de límite para la posición negativa de los bancos en moneda extranjera, es decir, les puso un tope al carry trade. Por último, modificó el cálculo de la posición global neta, que pasará a ser diario.",
    "url": "https://www.cronista.com/finanzas-mercados/la-respuesta-del-gobierno-a-las-versiones-sobre-el-uso-de-dolares-del-fmi-para-contener-la-divisa/",
    "source": "El Cronista",
    "published_at": "Actualizado el   30 de Agosto de 202516:40",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": null
    }
  },
  {
    "id": "977dcf4d9c50e179d56cbb225e8d1c16",
    "title": "Un perfil exportador que sufre por el dólar y la caída de la construcción",
    "description": "El Cronista en Corrientes",
    "content": "Loscorrentinosestán orgullosos de su tierrapero apenas se los indaga un poco,hablan de oportunidades perdidas a lo largo de décadasy de un panorama económico que no termina de despegar.  Del mito a la realidad,la provincia tiene un perfil exportador neto, expuesto a los vaivenes de la política económica nacional e internacionaly que está \"fuertemente primarizado\".\nAsí lo describen desde las cámaras empresarias locales, que destacan una potencialidad que cuesta desplegar totalmente. Primera en industria forestal y arrocera, creciente en la ganadera y citrícola, innova como destino turístico con los Esteros del Iberá, un paisaje con pocos competidores a nivel mundial. Sin embargo,se trata de actividades con poca tecnificación y que no generan empleo intensivo.\nEso hace queel empleo públicosignifique un poco más de la mitad de la población económicamente activa: \"No estamos al nivel de otras provincias del norte, pero es un número alto para una con tantos recursos\", señala un político correntino que buscará ser votado el próximo domingo para un cargo importante.\nSi se toma en cuenta el empleo público asalariado, el Instituto de Estadísticas local señala queCorrientes pasó de88.036 empleos públicos en 2014(con 1.065.962 habitantes, es decir, 83 por mil) a99.006 empleos en 2023(con 1.231.219 habitantes, es decir, 80 por mil).\nAunque no existen estadísticas más actualizadas sobre el tema, sí se sabe que el empleo privado, en tanto, fue de 79.414 puestos en enero de 2025.\nEn lo que respecta a la producción, en la campaña 2024/25 Corrientes alcanzó109.000 hectáreas sembradas de arroz, lo que representa un crecimiento interanual del 13,6 %, convirtiéndose en el principal núcleo productivo que, a nivel país, cuenta con unas 223.500 ha.\nLa cosecha 2024 fue \"muy buena\", afirman los empresarios. Sin embargo, el reingreso de India al mercado internacional después de dos añoshizo caer los valores del comercio.Por otra parte, la demanda del mercado interno \"es inelástica\".\n\"En Argentina puede variar el consumo de carne, pero la gente come 8 kilos de arroz por año\", añadió.\nPor otra parte, Corrientes es la provincia más forestada del país, con plantaciones principales de pino y eucalipto.Sin embargo, el párate de la construcción a nivel nacional afectó de manera directa a la producción maderera.\nRespecto del turismo, que es claramente receptivo, no existen estadísticas, pero se estima que sufre las mismas dificultades que en los principales centros del país,en particular por el tipo de cambio del dólar.\nA la hora de analizar otras dificultades, los empresarios correntinos hablan delos costos de logística, el mal estado de las rutas y las oportunidades perdidas para convertir a la provincia en un centro del comercio del Mercosur.\nCorrientes linda con los tres socios fundadores de Argentina en el bloque regional y, además, podría convertirse en el paso del comercio bioceánico entre Brasil y Chile. Adicionalmente,tiene acceso a la Hidrovía: sobre ese punto existe polémica por la construcción del puerto de Ituzaingó, promocionado como el \"más grande de la región\", pero que está por fuera de la red troncal Paraná-Paraguay.\nTambién se señala como problemática la distribución de energía proveniente deYacyretá. Aunque no es responsabilidad directa del ente binacional, los correntinos se quejan de la baja calidad del servicio eléctrico y de sus costos, con boletas que superan con facilidad los $100 mil en una vivienda de tres habitaciones.\n\n\"El servicio es malo, con micro-cortes que afectan a cualquier máquina productiva. Pero es más un problema de la distribuidora, que está intervenida y no mejora su servicio\", explicó un empresario textil a este diario.\nCorrientes enfrenta un desafío estructural que va más allá de las coyunturas: transformar su potencial en un proyecto de desarrollo consistenteserá uno de los principales desafíos del próximo gobernador que se elige el domingo.",
    "url": "https://www.cronista.com/economia-politica/elecciones-corrientes-un-perfil-exportador-que-sufre-por-el-tipo-de-cambio-y-la-caida-de-la-construccion/",
    "source": "El Cronista",
    "published_at": "Actualizado el   30 de Agosto de 202514:00",
    "collected_at": "2025-08-31 02:10:21.685089",
    "extra": {
      "image_url": null
    }
  }
]